<?xml version="1.0" encoding="UTF-8" standalone="yes"?><rss version="2.0" xmlns:atom="http://www.w3.org/2005/Atom"><channel><title>Ayuda Bingo</title><link>http://help.bingointelligence.com/</link><description>Manual online de la plataforma Bingo Intelligence</description><atom:link href="http://localhost/rss.xml" rel="self" type="application/rss+xml" /><item><title>¿Qué son los objetos vinculados?</title><link>http://localhost/</link><description><![CDATA[<div style="width:700px"><div class="contenido"><div><p>Los objetos vinculados sirven para que columnas de distintos paneles se mantengan sincronizadas. Es decir, dos columnas vinculadas muestran siempre el mismo contenido, incluso si se hace drill-down o se sustituye una dimensi&#243;n por otra…</p><p>Los objetos vinculados habitualmente se usan en estas dos situaciones:</p><ul><li>Cuando se quiere que una tabla y un gr&#225;fico muestren la misma informaci&#243;n (y que al modificar la tabla se actualice el gr&#225;fico, y viceversa)</li><li>Cuando se quiere que los paneles de un informe muestren el mismo indicador (y que si se cambia en uno, se cambie en todos).</li></ul><h3>C&#243;mo se vinculan las columnas</h3><p>El siguiente informe muestra una tabla y un gr&#225;fico con las ventas por pa&#237;s:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/objetos-vinculados-1.png" alt="Tabla y gráfico que muestran la misma información." title="Tabla y gráfico que muestran la misma información." width="470" height="295" /></p><p>Desde las propiedades avanzadas de la columna “Pa&#237;s”, se puede vincular la tabla y el gr&#225;fico para que permanezcan sincronizados. </p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/objetos-vinculados-2.png" alt="Propiedades avanzadas de una columna. Objeto vinculado." title="Propiedades avanzadas de una columna. Objeto vinculado." width="567" height="406" /></p><p>Al pulsar el bot&#243;n para seleccionar el objeto vinculado, debemos seleccionar la columna “Pa&#237;s” del otro panel. </p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/objetos-vinculados-3.png" alt="Selector del objeto vinculado" title="Selector del objeto vinculado" width="302" height="452" /></p><p>Una vez vinculado, si sustituimos la dimensi&#243;n “Pa&#237;s” por otra dimensi&#243;n (o si hacemos drill-down), el gr&#225;fico se actualizar&#225; del mismo modo:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/objetos-vinculados-4.png" alt="Al sustituir una columna se actualiza tanto la tabla como el gráfico." title="Al sustituir una columna se actualiza tanto la tabla como el gráfico." width="567" height="713" /></p><h3>Vinculaci&#243;n de 3 o m&#225;s columnas</h3><p>Del mismo modo, se pueden vincular columnas de 3 o m&#225;s paneles entre si. En este caso, al cambiar un indicador en uno de los paneles, el cambio se propaga a todos los paneles vinculados.</p></div></div></div>]]></description><pubDate>Fri, 16 Nov 2012 18:12:59 +0100</pubDate><guid isPermaLink="true">http://localhost/</guid></item><item><title>Gestión de usuarios</title><link>http://localhost/</link><description><![CDATA[<div style="width:700px"><div class="contenido"><div><h3>Introducci&#243;n</h3><p>La gesti&#243;n de usuarios de Bingo Intelligence es sencilla y flexible al mismo tiempo.</p><p>B&#225;sicamente, se deben crear los usuarios dentro de una estructura de carpetas y subcarpetas desde el “Administrador de usuarios”. Una vez creados los usuarios, se deben asignar los permisos sobre cada cat&#225;logo y cada aplicaci&#243;n en particular.</p><p>Es importante se&#241;alar que para ver los informes de una aplicaci&#243;n los usuarios necesitan permisos de acceso a esa aplicaci&#243;n y al cat&#225;logo que utiliza.</p><p>En este art&#237;culo se describe la gesti&#243;n de usuarios con mayor detalle.</p><h3>Tipos de usuarios</h3><p>Se pueden crear tres tipos de usuario con unas caracter&#237;sticas muy diferenciadas:</p><ul><li><b>Administrador:</b><span> El usuario podr&#225; trabajar con Bingo Intelligence </span><span style="text-decoration: underline;">sin ninguna restricci&#243;n</span><span>. Un administrador puede ver y editar cualquier cat&#225;logo y aplicaci&#243;n. Los administradores son los responsables de la gesti&#243;n de usuarios.  </span></li><li><b>Dise&#241;ador.</b><span> Este perfil permite trabajar con el dise&#241;ador de cat&#225;logos de Bingo Intelligence. T&#237;picamente, los dise&#241;adores son trabajadores con un perfil t&#233;cnico que conocen la estructura de la base de datos y son los encargados de la creaci&#243;n del cat&#225;logo seg&#250;n los requerimientos de los usuarios. Un dise&#241;ador s&#243;lo puede trabajar con los cat&#225;logos a los que tiene acceso. Tambi&#233;n puede abrir aplicaciones e informes, aunque solo aquellos a los que tiene acceso. Un dise&#241;ador no puede administrar usuarios.</span></li><li><b>Usuario de negocio.</b><span> Este perfil no permite administrar usuarios ni cat&#225;logos. Solo puede abrir y modificar aplicaciones e informes, y s&#243;lo aquellos a las que tenga acceso.</span></li></ul><p>Bingo Intelligence utiliza un icono distinto para identificar cada tipo de usuario.</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/iconos-tipos-usuarios.png" alt="Existen tres perfiles típicos en cualquier solución de Business Intelligence: El administrador, del sistema, el técnico-diseñador, y el usuario de negocio." title="Existen tres perfiles típicos en cualquier solución de Business Intelligence: El administrador, del sistema, el técnico-diseñador, y el usuario de negocio." width="566" height="309" /></p><h3>Grupos de usuarios</h3><p>Los usuarios se crean y se organizan en carpetas desde el “Administrador de usuarios” (en el men&#250; “Herramientas”). </p><p>La organizaci&#243;n en carpetas y subcarpetas de usuarios habitualmente corresponde con la estructura organizativa de la empresa y sirve para agrupar usuarios con perfiles y necesidades an&#225;logas. Estas carpetas de usuarios se utilizar&#225;n posteriormente para asignar los permisos de acceso a los cat&#225;logos y aplicaciones.</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/administrador-de-usuarios.png" alt="Desde el administrador de usuarios se crean los usuarios de la solución Business Intelligence y se organizan en carpetas." title="Desde el administrador de usuarios se crean los usuarios de la solución Business Intelligence y se organizan en carpetas." width="369" height="515" /></p><p>Tal como muestra el siguiente diagrama, un mismo usuario puede pertenecer a varios grupos.</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/usuarios-en-dos-grupos-bi.png" alt="Es habitual que una misma persona pertenezca a varios equipos de trabajo de la organización. Nuestra solución de Business Intelligence contempla estas situaciones y facilita su administración." title="Es habitual que una misma persona pertenezca a varios equipos de trabajo de la organización. Nuestra solución de Business Intelligence contempla estas situaciones y facilita su administración." width="475" height="237" /></p><p>Para ello, debe seleccionarse la opci&#243;n “Duplicar” del men&#250; contextual del usuario, y debe arrastrarse el duplicado a la nueva carpeta. Los usuarios duplicados se representan con un icono espec&#237;fico y son, a todos los efectos, el mismo usuario.</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/usuario-en-dos-grupos-bi-y-2.png" alt="Proceso para duplicar un usuario y asignarlo a otro grupo." title="Proceso para duplicar un usuario y asignarlo a otro grupo." width="630" height="280" /></p><p>En la tercera imagen se muestra como el usuario “Pepito” pertenece a los grupos “Equipo 1”, “Equipo 2”, y “Mi organizaci&#243;n”.  </p><p>Los permisos, tal como se describe a continuaci&#243;n, se aplican de manera acumulativa. Es decir, cada usuario acumula todos los permisos que est&#233;n concedidos expl&#237;citamente a &#233;l o a cualquiera de los grupos a los que pertenezca. </p><h3>Permisos de cat&#225;logo</h3><p>De manera predeterminada, el creador de un cat&#225;logo se convierte en su propietario. El propietario de un cat&#225;logo tiene un acceso completo y sin restricciones al mismo. Desde la ventana de propiedades, el propio propietario o un administrador del sistema pueden configurar los permisos del cat&#225;logo.</p><p>Para dar acceso al cat&#225;logo a otros usuarios o grupos se deben asignar los permisos. Existen 3 tipos de permisos que se pueden asignar:</p><ul><li><b>Control total:</b><span> Los usuarios (o grupos) con este permiso podr&#225;n conectarse al cat&#225;logo y, si son dise&#241;adores, podr&#225;n modificarlo.</span></li><li><b>S&#243;lo lectura.</b><span> Los usuarios (o grupos) con este permiso podr&#225;n conectarse al cat&#225;logo desde una aplicaci&#243;n.</span></li><li><b>Perfil personalizado.</b><span> Aunque no es habitual, se pueden definir otros perfiles intermedios personalizados. </span></li></ul><p>En la siguiente imagen se ha creado un permiso para que cualquier usuario de “Mi organizaci&#243;n” pueda conectarse a este cat&#225;logo para hacer consultas.</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/permisos-propiedades-catalogo.png" alt="Solo un administrador o el propietario del catálogo pueden asignar los permisos al catálogo Business Intelligence." title="Solo un administrador o el propietario del catálogo pueden asignar los permisos al catálogo Business Intelligence." width="481" height="574" /></p><p>Si se desmarca la opci&#243;n “Aplicar restricciones de seguridad a este cat&#225;logo”, cualquier usuario del sistema podr&#225; utilizar este cat&#225;logo (y modificarlo, si es dise&#241;ador).</p><p>Con el bot&#243;n “Nuevo permiso” podemos crear un nuevo permiso para que cualquier dise&#241;ador de IT pueda modificar el cat&#225;logo:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/permisos-it.png" alt="Se concede permiso de control total al departamento IT." title="Se concede permiso de control total al departamento IT." width="349" height="397" /></p><h3>Permisos de aplicaci&#243;n</h3><p>De manera predeterminada, el creador de una aplicaci&#243;n se convierte en su propietario. El propietario de una aplicaci&#243;n tiene un acceso completo y sin restricciones a la misma. Desde la ventana de propiedades de la aplicaci&#243;n, el propio propietario o un administrador del sistema pueden configurar los permisos de la aplicaci&#243;n.</p><p>Para dar acceso a la aplicaci&#243;n a otros usuarios se deben asignar los permisos. Existen 3 tipos de permisos que se pueden asignar:</p><ul><li><b>Control total:</b><span> Los usuarios (o grupos) con este permiso podr&#225;n abrir la aplicaci&#243;n y modificarla libremente (crear o modificar sus informes, etc.)</span></li><li><b>S&#243;lo visualizaci&#243;n.</b><span> Los usuarios (o grupos) con este permiso podr&#225;n abrir la aplicaci&#243;n y navegar por sus datos (pero no podr&#225;n modificar ning&#250;n informe, panel o consulta).</span></li><li><b>Personalizado.</b><span> Aunque no es habitual, se pueden crear otros permisos intermedios personalizados.</span></li></ul><p>En  la siguiente imagen se han creados dos permisos para que cualquier usuario del “Equipo 1” pueda abrir la aplicaci&#243;n y modificarla. Adem&#225;s, cualquier usuario del “Equipo 2” podr&#225; abrir los informes y visualizarlos, pero no podr&#225; modificarlos.</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/permisos-propiedades-aplicacion.png" alt="Solo el propietario o un administrador puede gestionar los permisos de una aplicación de Business Intelligence." title="Solo el propietario o un administrador puede gestionar los permisos de una aplicación de Business Intelligence." width="553" height="611" /></p><p>Si se desmarca la opci&#243;n “Aplicar restricciones de seguridad a esta aplicaci&#243;n”, cualquier usuario del sistema podr&#225; abrir y modificar esta aplicaci&#243;n.</p><p>Es importante se&#241;alar que para ver los informes de una aplicaci&#243;n los usuarios necesitan permisos de acceso a esa aplicaci&#243;n y al cat&#225;logo que utiliza.</p></div></div></div>]]></description><pubDate>Fri, 25 May 2012 11:52:51 +0100</pubDate><guid isPermaLink="true">http://localhost/</guid></item><item><title>¿Qué son las soluciones locales?</title><link>http://localhost/</link><description><![CDATA[<div style="width:700px"><div class="contenido"><div><h3>Tipos de soluci&#243;n</h3><p>En Bingo Intelligence se denomina “soluci&#243;n” a un conjunto de aplicaciones y cat&#225;logos. Existen dos tipos de soluciones:</p><ul><li><b>Soluciones de servidor: </b><span>En  las soluciones de servidor los cat&#225;logos y aplicaciones est&#225;n guardados en una base de datos, y los usuarios acceden a ellos a trav&#233;s de un servidor de Bingo Intelligence. El sistema se encarga de mostrar a cada usuario la informaci&#243;n a la que se tiene acceso (se puede restringir el acceso a determinadas aplicaciones y/o cat&#225;logos, etc.)</span><b></b></li><li><b>Soluciones locales: </b><span>En las soluciones locales los cat&#225;logos y las aplicaciones se guardan en un archivo en el ordenador del usuario. Las soluciones locales no implementan ning&#250;n control de acceso, por lo que cualquier persona con acceso al archivo de la soluci&#243;n, podr&#225; abrir los informes y navegar por la informaci&#243;n.</span><b></b></li></ul><h3>Ventajas de las soluciones de servidor</h3><p><span>Habitualmente, las empresas disponen de una &#250;nica soluci&#243;n que contiene todas las aplicaciones Business Intelligence de la compa&#241;&#237;a. Evidentemente, se trata de una </span><b>soluci&#243;n de servidor</b><span>, y se definen controles de acceso para que cada departamento o equipo pueda acceder exclusivamente a su informaci&#243;n. </span></p><p>Esta manera de trabajar presenta algunas ventajas significativas:</p><ul><li><b>Facilidad de administraci&#243;n.</b><span> Toda la informaci&#243;n est&#225; guardada en una &#250;nica base de datos o repositorio. Esta base de datos contiene no s&#243;lo la definici&#243;n de todas las aplicaciones y cat&#225;logos, sino tambi&#233;n la configuraci&#243;n de las conexiones a las bases de datos, y la configuraci&#243;n de los usuarios. Haciendo copias de seguridad regulares de este repositorio los administradores del sistema pueden restaurar el sistema en caso de necesidad. </span></li><li><b>Control de accesos.</b><span> Tal y como se ha comentado, en las soluciones de servidor es posible crear usuarios con diferentes roles, y es posible limitar el acceso a determinados cat&#225;logos y aplicaciones. </span></li><li><b>Acceso remoto.</b><span> Cualquier usuario con acceso al servidor de Bingo Intelligence podr&#225; acceder a la informaci&#243;n corporativa. Ni los informes ni la informaci&#243;n que muestran se guarda en el PC local del usuario. Tampoco es necesario configurar los drivers de base de datos en los ordenadores de los usuarios (ya que el servidor de Bingo Intelligence centraliza todas las consultas de los usuarios). Todo est&#225; en el servidor y el usuario s&#243;lo necesita instalarse el cliente de Bingo Intelligence.</span></li></ul><h3>Usos de las soluciones locales</h3><p><span>Las soluciones locales no necesitan un servidor de Bingo Intelligence. Tampoco existe una base de datos donde se guarde la configuraci&#243;n de los cat&#225;logos y de las aplicaciones. </span><b>Toda la configuraci&#243;n de la soluci&#243;n se guarda en un archivo con extensi&#243;n .bi</b></p><p><span>Es importante destacar que aunque no se requiere un servidor de Bingo Intelligence sigue siendo necesario disponer de una base de datos donde est&#225; la informaci&#243;n que mostrar&#225;n las aplicaciones. Es decir: </span><b>Las soluciones locales se conectan directamente a la base de datos corporativa donde est&#225; la informaci&#243;n.</b><span>  Es necesario, por lo tanto, tener un datawarehouse, un datamart, o una base de datos relacional con la informaci&#243;n corporativa. Esta base de datos debe estar accesible desde el ordenador de los usuarios.</span></p><p>Las soluciones locales se utilizan habitualmente en tres escenarios:</p><ul><li><b>Microinstalaciones. </b><span>Si &#250;nicamente existe un usuario</span><b> </b><span>del sistema, o existen varios usuarios que no acceden simult&#225;neamente, las soluciones locales pueden ser una buena opci&#243;n. Al trabajar en local, no es necesario instalar el servidor por lo que la instalaci&#243;n y puesta en marcha suele ser m&#225;s r&#225;pida. En las “microinstalaciones” todos los usuarios son administradores (y tienen por lo tanto un acceso completo a la soluci&#243;n). </span><b></b></li><li><b>Entornos de desarrollo. </b><span>Es habitual crear prototipos o realizar pruebas desde soluciones locales. De este modo, se pueden usar todas las funcionalidades de Bingo Intelligence sin necesidad de afectar al servidor de producci&#243;n de Bingo Intelligence. Nadie tendr&#225; acceso a estos desarrollos o pruebas (salvo que se comparta el archivo .bi de la soluci&#243;n).</span><b></b></li><li><b>Versi&#243;n de evaluaci&#243;n. </b><span>La versi&#243;n de evaluaci&#243;n de Bingo Intelligence permite crear soluciones locales. De este modo, es posible evaluar el producto libremente, accediendo a tus propias bases de datos, y la instalaci&#243;n resulta muy sencilla (no es necesario instalar el servidor ni crear el repositorio).</span><b></b></li></ul><p><span>Normalmente, cada soluci&#243;n local consiste en un &#250;nico cat&#225;logo  y en una &#250;nica aplicaci&#243;n. Si se quiere trabajar en local, y se dispone de diferentes bases de datos, </span><b>lo habitual es crear una soluci&#243;n local para cada base de datos</b><span>. De este modo, las aplicaciones se mantienen aisladas (y es posible compartirlas mediante carpetas compartidas, o incluso por correo electr&#243;nico).</span></p><h3>C&#243;mo se crea una soluci&#243;n local</h3><p>Existen dos maneras de crear una soluci&#243;n en local:</p><ul><li>Crear una nueva soluci&#243;n en local desde el “Panel de Bienvenida”</li><li>Exportar una soluci&#243;n existente</li></ul><h4>Desde el “Panel de bienvenida”</h4><p>Es posible crear una soluci&#243;n local nueva desde el “Panel de Bienvenida”  de Bingo Intelligence.</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/panel-bienvenida-business-intelligence.png" alt="Es posible crear una solución local nueva desde el “Panel de Bienvenida”  de Bingo Intelligence." title="Es posible crear una solución local nueva desde el “Panel de Bienvenida”  de Bingo Intelligence." width="569" height="755" /></p><p>Para crear una soluci&#243;n local, se tiene que seleccionar alguna de las tecnolog&#237;as disponibles, o seleccionar la soluci&#243;n local de prueba (LA BIBLIO) que est&#225; disponible de manera predeterminada.</p><p>Al seleccionar una tecnolog&#237;a, aparecer&#225; una ventana para definir la conexi&#243;n, y posteriormente podremos crear un cat&#225;logo utilizando esa conexi&#243;n, y podremos crear una aplicaci&#243;n. Al guardar la soluci&#243;n local (desde el men&#250; “Herramientas”), se nos solicitar&#225; el nombre y la ubicaci&#243;n donde guardar la soluci&#243;n local.</p><p>El siguiente v&#237;deo muestra a partir del minuto 1:20 el proceso completo para crear un cat&#225;logo y una peque&#241;a aplicaci&#243;n en local:</p><img src="http://help.bingointelligence.com/images/youtube.jpg" alt="Elemento multimedia" title="Elemento multimedia" style="display:block;text-align:center;margin-left:auto;margin-right:auto;" /><h4>Exportaci&#243;n de una aplicaci&#243;n</h4><p>Es posible crear una soluci&#243;n local exportando una aplicaci&#243;n de una soluci&#243;n de servidor. Al exportar una aplicaci&#243;n, se genera una soluci&#243;n en local que contiene esa aplicaci&#243;n y todos los cat&#225;logos y conexiones necesarias. Una vez exportada, existir&#225;n dos aplicaciones independientes (en el servidor, y en la soluci&#243;n local reci&#233;n creada). </p><p><span>Para exportar una aplicaci&#243;n, se debe abrir el </span><b>“Administrador de aplicaciones”</b><span>, y seleccionar la opci&#243;n </span><b>“Guardar en local”</b><span> del men&#250; contextual.</span></p></div></div></div>]]></description><pubDate>Wed, 09 Nov 2011 14:16:13 +0100</pubDate><guid isPermaLink="true">http://localhost/</guid></item><item><title>El administrador de tablas y relaciones</title><link>http://localhost/</link><description><![CDATA[<div style="width:700px"><div class="contenido"><div><p>El administrador de tablas y relaciones es una funcionalidad a&#241;adida en Bingo Intelligence 2.0 (aka. Bingo Intelligence 2012) que permite importar las tablas y crear las relaciones sin necesidad de utilizar los tradicionales diagramas de tablas.</p><p>El siguiente v&#237;deo muestra su funcionamiento:</p><img src="http://help.bingointelligence.com/images/youtube.jpg" alt="Elemento multimedia" title="Elemento multimedia" style="display:block;text-align:center;margin-left:auto;margin-right:auto;" /></div></div></div>]]></description><pubDate>Tue, 01 Nov 2011 17:32:33 +0100</pubDate><guid isPermaLink="true">http://localhost/</guid></item><item><title>Cómo crear un catálogo</title><link>http://localhost/</link><description><![CDATA[<div style="width:700px"><div class="contenido"><div><p>El siguiente v&#237;deo muestra c&#243;mo crear un cat&#225;logo y se trata de un buen material para comenzar a trabajar con el dise&#241;ador de cat&#225;logos de Bingo Intelligence. </p><img src="http://help.bingointelligence.com/images/youtube.jpg" alt="Elemento multimedia" title="Elemento multimedia" style="display:block;text-align:center;margin-left:auto;margin-right:auto;" /><p><span>El </span><a href="http://help.bingointelligence.com/tema.html?id=8">resto de art&#237;culos</a><span> de este apartado dewscriben las funcionalidades con m&#225;s detalle</span></p></div></div></div>]]></description><pubDate>Tue, 01 Nov 2011 17:21:15 +0100</pubDate><guid isPermaLink="true">http://localhost/</guid></item><item><title>Problemas durante la instalación</title><link>http://localhost/</link><description><![CDATA[<div style="width:700px"><div class="contenido"><div><p>Los problemas m&#225;s habituales durante la instalaci&#243;n aparecen al verificar la conexi&#243;n con el servicio web, donde puede aparecer un mensaje similar a &#233;ste:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/500-internal-error.png" alt="(500) Internal server error" title="(500) Internal server error" width="498" height="316" /></p><p>En estos casos, se debe verificar la instalaci&#243;n y configuraci&#243;n del servidor IIS.</p><h3>Servicio IIS</h3><p>Cuando se env&#237;a una petici&#243;n en el servidor IIS, el propio IIS es el primero que la recibe y la procesa. Para verificar que el IIS est&#225; activo y funcionando se puede verificar la siguiente direcci&#243;n:</p><ul><li><a>http://localhost/bingo/images/bingo-analisis.png</a><span></span></li></ul><p>Si todo est&#225; correcto, debe cargarse una imagen en el explorador web:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/explorer-con-bingo-logo.png" alt="Debe aparecer una imagen." title="Debe aparecer una imagen." width="515" height="275" /></p><p>Si no aparece este icono, y aparece un mensaje de error, se trata de un problema de la configuraci&#243;n del IIS. Tal vez no est&#225; instalado, o no est&#225; ejecut&#225;ndose en este momento, o existe un problema en la direcci&#243;n URL que se est&#225; introduciendo en la barra de direcciones del explorador web.</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/error-404.png" alt="Internet Explorer no puede mostrar la página web" title="Internet Explorer no puede mostrar la página web" width="520" height="330" /></p><p>Revise la instalaci&#243;n del IIS.</p><h3>ASP.NET</h3><p>ASP.NET es la plataforma para el desarrollo de aplicaciones web de Microsoft. Bingo Intelligence utiliza la versi&#243;n 4 de ASP.NET (.NET Framework 4).</p><p>Para verificar si est&#225;n los componentes de ASP.NET instalados, y correctamente configurados, puede verificar esta direcci&#243;n:</p><ul><li><a>http://localhost/bingo/default.aspx</a><span></span></li></ul><p>Debe aparecer una p&#225;gina semejante a &#233;sta:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/explorer-con-default.aspx.png" alt="La página de entrada de Bingo Intelligence" title="La página de entrada de Bingo Intelligence" width="567" height="407" /></p><p><span>Si se ha podido instalar el “Administrador de Bingo Intelligence” eso quiere decir que el </span><b>Framework 4</b><span> ya est&#225; instalado en el servidor. Si aparece un error se puede deber a que el componente ASP.NET no est&#225; instalado en el IIS, o que la aplicaci&#243;n no est&#225; utilizando la versi&#243;n 4.</span></p><p>Seg&#250;n la versi&#243;n del IIS, y del sistema operativo, puede aparecer alguno de los siguientes errores:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/500-19-server-error.png" alt="Los datos de configuración no son válidos" title="Los datos de configuración no son válidos" width="567" height="407" /></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/error-404-3-not-found.png" alt="Error MIME al cargar una página ASP.NET" title="Error MIME al cargar una página ASP.NET" width="567" height="244" /></p><p>En estos casos, debe verificar que la aplicaci&#243;n “Bingo” utiliza un grupo de aplicaciones con ASP.NET v4:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/config-aplicacion-iis.png" alt="Modificar aplicación (se debe utilizar ASP.NET v4)" title="Modificar aplicación (se debe utilizar ASP.NET v4)" width="439" height="304" /></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/iis-grupo-aplicaciones.png" alt="Configuración del grupo de aplicaciones" title="Configuración del grupo de aplicaciones" width="316" height="285" /></p><p>Los formularios anteriores pueden ser algo diferentes en funci&#243;n del sistema operativo.</p><p>Si en esos formularios no aparece la versi&#243;n 4 de ASP.NET, o si aun as&#237; no funciona, deber&#225; registrarlo manualmente desde la l&#237;nea de comandos. Se debe ejecutar:</p><p><b>C:\Windows\Microsoft.NET\Framework\v4.0.30319\aspnet_regiis.exe –i</b></p><p><span>Una vez ejecutada esta instrucci&#243;n, la p&#225;gina “default.aspx” se deber&#237;a cargar correctamente. En caso contrario, verifique el mensaje obtenido al ejecutar </span><b>aspnet_regiis.exe –i</b><span> </span></p><h3>Configuraci&#243;n Bingo</h3><p>Para verificar que la instalaci&#243;n es correcta, Bingo Intelligence verifica la configuraci&#243;n del sistema desde esta direcci&#243;n:</p><ul><li><a>http://localhost/bingo/configuration.ashx</a><span></span></li></ul><p>Al acceder a esa direcci&#243;n, debe aparecer un fichero XML similar a este:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/explorer-con-xml-config.png" alt="El archivo XML de configuración del servidor." title="El archivo XML de configuración del servidor." width="447" height="308" /></p><p>En caso contrario, verifique el mensaje de error en pantalla.</p><p><span>La p&#225;gina </span><b>configuration.ashx </b><span>s&#243;lo utiliza caracter&#237;sticas de ASP.NET v4, por lo que si funciona “Default.aspx”, debe funcionar tambi&#233;n &#233;sta.</span></p><h3>Servicio WCF</h3><p><span>Bingo Intelligence utiliza un servicio con la tecnolog&#237;a de </span><i>Windows Communications Foundation</i><span> (WCF) para establecer la comunicaciones entre los clientes y el servidor.</span></p><p>Para verificar que el servicio est&#225; funcionando, puede acceder a esta direcci&#243;n:</p><ul><li><a>http://localhost/bingo/BingoService.svc</a><span></span></li></ul><p>Debe aparecer esta pantalla:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/explorer-con-service.png" alt="Servicio Windows Communication Foundation" title="Servicio Windows Communication Foundation" width="534" height="433" /></p><p>Si aparece alg&#250;n error, se debe a alg&#250;n problema con WCF. Este componente forma parte del Framework 4, y se instala en el IIS al instalar y registrar ASP.NET v4. Si a&#250;n as&#237; no funciona, deber&#225; registrarlo de nuevo con esta instrucci&#243;n:</p><p><b>C:\Windows\Microsoft.NET\Framework\v4.0.30319\ServiceModelReg.exe –ia</b></p><p><span>Una vez ejecutada esta instrucci&#243;n, la p&#225;gina “BingoService.svc” se deber&#237;a cargar correctamente. En caso contrario, verifique el mensaje obtenido al ejecutar </span><b>ServiceModelReg.exe –ia</b></p><h3>Otros problemas de instalaci&#243;n</h3><p>Si persisten los problemas para instalar el servicio web de Bingo, p&#243;ngase en contacto con el servicio t&#233;cnico de Bingo Intelligence para que estudiar y diagnosticar el problema con mayor detalle.</p></div></div></div>]]></description><pubDate>Mon, 27 Sep 2010 16:22:24 +0100</pubDate><guid isPermaLink="true">http://localhost/</guid></item><item><title>Forzar la inclusión de tablas en las consultas</title><link>http://localhost/</link><description><![CDATA[<div style="width:700px"><div class="contenido"><div><h3>Tablas adicionales</h3><p>Desde el Dise&#241;ador de cat&#225;logos es posible forzar la inclusi&#243;n de determinadas tablas en las consultas SQL generadas. Esta opci&#243;n es &#250;til para obligar que se apliquen determinados filtros o determinadas relaciones.</p><p><span>Esta funcionalidad permite, por ejemplo, definir una pol&#237;tica de “</span><b>Seguridad horizontal</b><span>”. La seguridad horizontal se utiliza para limitar los registros a los que tiene acceso cada usuario. De esta manera, se puede configurar que cada responsable comercial s&#243;lo acceda a sus propias tiendas, o que los </span><i>Product Manager</i><span> s&#243;lo vean las ventas de sus productos.</span></p><h3>Definir una pol&#237;tica de seguridad horizontal</h3><p>Para aplicar la seguridad horizontal, las sentencias SQL generadas incluir&#225;n siempre un filtro que seleccione aquellos registros a los que tiene acceso cada usuario. Para ello, se tienen que seguir los siguientes pasos:</p><ul><li>Crear la tabla que definir&#225; la visibilidad de cada usuario</li><li>Incluir esa tabla en el diagrama de tablas</li><li>Forzar la inclusi&#243;n de dicha tabla en las consultas generadas</li></ul><h4>Crear la tabla que define la visibilidad de cada usuario</h4><p><span>Para definir la seguridad horizontal es necesario que exista en la base de datos una </span><i>tabla de seguridad</i><span> que defina la visibilidad de cada usuario:</span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/tabla-de-seguridad.png" alt="La tabla de seguridad se utiliza para definir la visibilidad de cada usuario." title="La tabla de seguridad se utiliza para definir la visibilidad de cada usuario." width="595" height="395" /></p><p>En este caso, se ha preparado una tabla que contiene el cruce de todos los usuarios y todas las tiendas, y un campo indicando si se tiene acceso o no. </p><h4>Incluir la tabla de seguridad en el diagrama</h4><p>La anterior tabla se debe incluir en el diagrama, y se debe relacionar con la tabla que se quiere filtrar.</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/diagrama-con-seguridad.png" alt="La tabla de seguridad se tiene que incluir en el diagrama de tablas." title="La tabla de seguridad se tiene que incluir en el diagrama de tablas." width="627" height="286" /></p><p><span>En la tabla </span><i>LB_SEGURIDAD_TIENDAS</i><span> el campo </span><i>ID_TIENDA</i><span> no es &#250;nico, por lo que se producir&#225;n duplicados al hacer la relaci&#243;n con la tabla de tiendas. Para evitar esto, </span><b>es necesario establecer un filtro sobre la tabla de seguridad. Este filtro es el que finalmente definir&#225; la visibilidad de cada usuario. </b><span>Para ello, se debe definir el campo WHERE desde el  formulario de propiedades de las tabla:</span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/filtro-tabla-seguridad.png" alt="Se debe definir un filtro en la tabla de seguridad para que cada usuario sólo vea sus datos." title="Se debe definir un filtro en la tabla de seguridad para que cada usuario sólo vea sus datos." width="511" height="672" /></p><p><span>El par&#225;metro </span><b>@USER</b><span> se sustituir&#225; por el nombre del usuario conectado a Bingo Intelligence.</span></p><h4>Forzar la inclusi&#243;n de la tabla de seguridad en las consultas</h4><p><span>El filtro definido anteriormente s&#243;lo se incluir&#225; en las consultas que hagan referencia a la tabla de seguridad (</span><i>LB_SEGURIDAD_TIENDAS</i><span>). Por lo tanto, de alguna manera, se ha de indicar cu&#225;ndo se debe incluir esa tabla. Para ello, se utilizan las </span><b>“Tablas adicionales”</b><span>.</span></p><p><span>En este ejemplo protegeremos la informaci&#243;n de “ventas”. Es decir, dejaremos que los usuarios puedan consultar el listado de las tiendas de la organizaci&#243;n, pero no permitiremos que tengan acceso a sus ventas. Esto se puede hacer desde las propiedades de la tabla de hechos (</span><i><b>LB_VENTAS</b></i><span>), en la pesta&#241;a “</span><b>Tablas adicionales</b><span>”: </span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/configuracion-tablas-adicionales.png" alt="Las tablas adicionales se incluirán en la query siempre que se utilice esta tabla (LB_VENTAS).
" title="Las tablas adicionales se incluirán en la query siempre que se utilice esta tabla (LB_VENTAS).
" width="481" height="667" /></p><p>De esta manera, siempre que se incluya un indicador o una dimensi&#243;n que haga referencia a la tabla de ventas, se incluir&#225; autom&#225;ticamente la tabla de seguridad (y el filtro de seguridad).</p><h4>Verificaci&#243;n de la seguridad horizontal</h4><p><span>Una vez configurada la tabla de seguridad conviene verificar que los filtros se aplican correctamente. Para ello, podemos utilizar el </span><a href="http://help.bingointelligence.com/articulo.html?id=43">probador de consultas</a><span>, o podemos crear un informe contra este cat&#225;logo. En ese caso, nos hemos conectado con el usuario “</span><i>demo espa&#241;a</i><span>”, y hemos realizado un peque&#241;o informe:</span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/informe-seguridad-horizontal.png" alt="El informe sólo muestra la información a la que el usuario tiene acceso." title="El informe sólo muestra la información a la que el usuario tiene acceso." width="504" height="607" /></p></div></div></div>]]></description><pubDate>Wed, 22 Sep 2010 10:49:36 +0100</pubDate><guid isPermaLink="true">http://localhost/</guid></item><item><title>Creación de indicadores básicos</title><link>http://localhost/</link><description><![CDATA[<div style="width:700px"><div class="contenido"><div><h3>Indicadores</h3><p>Los indicadores son las medidas cuantitativas que se incluyen en los informes corporativos e informan sobre la evoluci&#243;n o el estado de alguna &#225;rea del negocio. Indicadores habituales son “Ventas”, “Compras”, “N&#250;mero de empleados”, etc. Se trata de informaci&#243;n num&#233;rica, y se suele incluir en las cl&#225;usulas&#160;SELECT&#160;con alguna funci&#243;n de agregaci&#243;n (&#160;sum&#160;,&#160;avg&#160;,&#160;min&#160;,&#160;max&#160;,...).</p><p><span>En los </span><a href="http://help.bingointelligence.com/articulo.html?id=42">cat&#225;logos de Bingo Intelligence</a><span> los indicadores se representan con un icono con forma de “bola roja”. En el art&#237;culo sobre </span><a href="http://help.bingointelligence.com/articulo.html?id=38">c&#243;mo construir un  cat&#225;logo</a><span> se definen unos pocos indicadores b&#225;sicos:</span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/indicadores-en-universo.png" alt="Algunos indicadores del universo LA BIBLIO" title="Algunos indicadores del universo LA BIBLIO" width="458" height="298" /></p><h3>Indicadores b&#225;sicos</h3><p>En la mayor&#237;a de los casos los indicadores se calculan sumando los valores de un campo. Por ejemplo, el indicador “Unidades vendidas” se calcula sumando las unidades vendidas en cada transacci&#243;n de venta. Del mismo modo, se calculan muchos otros indicadores habituales (costes, compras, unidades defectuosas, presupuestos,...).</p><p><span>En estos casos, se puede crear un indicador arrastr&#225;ndolo desde la tabla al panel de navegaci&#243;n de objetos, y seleccionando la opci&#243;n “</span><b>Convertir en indicador</b><span>” del men&#250; contextual (bot&#243;n derecho).</span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/menu-convertir-indicador.png" alt="Opción de &quot;Convertir en indicador&quot;" title="Opción de &quot;Convertir en indicador&quot;" width="419" height="204" /></p><p><span>Una vez creado siempre se puede modificar su definici&#243;n desde el formulario de “</span><b>Propiedades</b><span>” del objeto. Por ejemplo, se podr&#237;a cambiar la funci&#243;n de agregaci&#243;n SUM por cualquier otra que soporte la base de datos.</span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/propiedades-indicador-muy-basico.png" alt="Formulario de propiedades de un indicador" title="Formulario de propiedades de un indicador" width="457" height="457" /></p><p>Tambi&#233;n se puede renombrar el indicador directamente desde el panel de navegaci&#243;n de objetos. Para ello, se debe seleccionar el indicador y pulsar F2, o mediante un “doble clic lento” del rat&#243;n.</p><h3>Indicadores con operaciones aritm&#233;ticas</h3><p><span>En el campo </span><b>SELECT</b><span> de la ventana de propiedades se puede incluir cualquier expresi&#243;n SQL soportada por el gestor de la base de datos, incluyendo todas las operaciones aritm&#233;ticas, y las funciones propias del dialecto SQL de la base de datos que se est&#233; utilizando. En el momento de generar la consulta, </span><a href="http://help.bingointelligence.com/articulo.html?id=43">el generador de consultas de Bingo Intelligence</a><span> incluir&#225; esa expresi&#243;n en la cl&#225;usula SELECT de la sentencia SQL, y </span><b>ser&#225; el motor de la base de datos quien realice el c&#225;lculo</b><span>. </span></p><p>Se puede hacer referencia a varios campos, incluso si est&#225;n en tablas diferentes, y se pueden hacer operaciones entre ellos. En el caso de que se incluyan referencias a diferentes tablas, el generador de consultas de Bingo Intelligence lo tendr&#225; en cuenta para a&#241;adir las tablas y relaciones que sean necesarias.</p><p>Por ejemplo, algunos indicadores habituales se pueden definir mediante expresiones SQL similares a las siguientes:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/indicadores-simples-sql.png" alt="Varias expresiones SQL habituales" title="Varias expresiones SQL habituales" width="410" height="141" /></p><p>Algunas consideraciones importantes son:</p><ul><li><span>Es necesario utilizar la nomenclatura </span><b>[TABLA].[CAMPO]</b><span> para referirse a cualquier campo. No hay que poner el nombre de la base de datos ni el esquema. Es obligatorio mencionar el nombre de la tabla.</span></li><li>Todas las tablas referenciadas deben estar importadas en el cat&#225;logo y deben figurar en el diagrama.</li><li>Todas las tablas mencionadas en la definici&#243;n de un indicador han de pertenecer a la misma “estrella”. Es decir, ha de ser posible unir todas las tablas mencionadas a trav&#233;s de las relaciones del cat&#225;logo.</li></ul><h3>Indicadores con filtros</h3><p>En muchos informes se compara un mismo indicador entre dos fechas determinadas. Por ejemplo, es muy habitual comparar las ventas de este a&#241;o respecto las del a&#241;o anterior. </p><p><b>Es posible incluir un filtro en la definici&#243;n de un indicador. </b><span> Gracias a esta funcionalidad es posible definir los indicadores “</span><i>Ventas a&#241;o actual</i><span>”, “</span><i>Ventas a&#241;o anterior</i><span>”, “</span><i>Ventas nacionales</i><span>”, etc.</span></p><p><span>De esta manera, por ejemplo, los usuarios podr&#225;n incluir los indicadores “</span><i>Ventas a&#241;o actual</i><span>” y “</span><i>Ventas a&#241;o anterior</i><span>” en una consulta y compararlos entre s&#237;. Para ello, si es necesario, el generador de consultas de Bingo Intelligence generar&#225; varias sentencias SQL independientes, y sincronizar&#225; los resultados.</span><b></b></p><p><span>Para hacer este tipo de informes no es estrictamente necesario definir estos indicadores en el cat&#225;logo. Los usuarios podr&#237;an utilizar el indicador gen&#233;rico “</span><i>Ventas</i><span>”, y aplicar manualmente los filtros. Sin embargo, al ser una necesidad tan habitual, </span><b>se recomienda definir este tipo de indicadores en el cat&#225;logo</b><span>, y simplificar as&#237; el trabajo de elaboraci&#243;n de los informes de una manera significativa.</span></p><p><span>Para incluir un filtro en la definici&#243;n del indicador se tiene que completar el campo </span><b>WHERE </b><span>del formulario de propiedades. </span></p><p><span>Vamos a crear el indicador “</span><i>Unidades a&#241;o actual</i><span>” utilizando el ejemplo de </span><b>LA BIBLIO</b><span>. Para ello, arrastramos el campo </span><i>LB_VENTAS.UNIDADES</i><span> al panel de navegaci&#243;n de objetos, lo convertimos en indicador, abrimos su formulario de propiedades, y lo completamos de la siguiente manera:</span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/unidades-anyo-actual.png" alt="Formulario de propiedades del indicador &quot;Unidades año actual&quot;" title="Formulario de propiedades del indicador &quot;Unidades año actual&quot;" width="503" height="513" /></p><p><span>En este caso, en la cl&#225;usula </span><b>WHERE </b><span>se han incluido dos funciones de SQL Server (</span><i>year</i><span> y </span><i>getdate</i><span>). Para obtener el mejor rendimiento, </span><b>se recomienda tener precalculado este tipo de filtros</b><span>. De esta manera, el WHERE quedar&#237;a m&#225;s sencillo: </span><i><b>LB_TIEMPO.ES_ANYO_ACTUAL=1</b></i><span>.</span></p><p><span>Una vez creado el indicador “</span><i>Unidades a&#241;o actual</i><span>”, se pueden repetir los pasos para crear “</span><i>Unidades a&#241;o anterior</i><span>”. Del mismo modo, se podr&#237;an crear indicadores an&#225;logos para los importes y los costes.</span></p><p>Finalmente, se deben ordenar los indicadores de la manera que resulte m&#225;s conveniente para los usuarios. </p><p>Cuando existen pocos indicadores, se pueden mostrar mediante un sencillo listado:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/organizacion-indicadores1.png" alt="Organización simple de los indicadores del catálogo." title="Organización simple de los indicadores del catálogo." width="261" height="239" /></p><p>Sin embargo, cuando el n&#250;mero de indicadores es elevado se recomienda organizarlos mediante carpetas y subcarpetas o de modo anidado:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/organizacion-indicadores2.png" alt="Dos opciones para organizar los indicadores del catálogo." title="Dos opciones para organizar los indicadores del catálogo." width="539" height="282" /></p><p><span>Una vez creados y ordenados todos los indicadores conviene verificar que el funcionamiento es el esperado. Para ello, podemos utilizar el “</span><a href="http://help.bingointelligence.com/articulo.html?id=43">Probador de consultar</a><span>”, o crear un sencillo informe utilizando este cat&#225;logo:</span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/informe-comparativa-anyo-anterior.png" alt="Este informe se ha preparado ejecutando dos consultas SQL (una para cada filtro). Además, se ha añadido una fórmula y un formato condicional." title="Este informe se ha preparado ejecutando dos consultas SQL (una para cada filtro). Además, se ha añadido una fórmula y un formato condicional." width="415" height="552" /></p><h3>Siguientes pasos</h3><p><span>En el art&#237;culo sobre </span><a href="http://help.bingointelligence.com/articulo.html?id=44">c&#243;mo crear indicadores avanzados</a><span> se explica c&#243;mo se pueden crear indicadores acumulados (YTD, MTD, etc.) y m&#243;viles (medias m&#243;viles, TAM, etc.).</span></p></div></div></div>]]></description><pubDate>Tue, 21 Sep 2010 23:27:22 +0100</pubDate><guid isPermaLink="true">http://localhost/</guid></item><item><title>Creación de indicadores avanzados</title><link>http://localhost/</link><description><![CDATA[<div style="width:700px"><div class="contenido"><div><h3>Indicadores acumulados</h3><p><span>En muchos informes de negocio se utilizan </span><b>indicadores acumulados</b><span> desde principio de a&#241;o o desde principio de mes. De este modo, se habla de las ventas YTD (</span><i>year-to-date</i><span>) para referirse a las ventas desde el 1 de enero, o se habla de las ventas MTD (</span><i>month-to-date</i><span>) para referirse a las ventas desde el primer d&#237;a del mes.</span></p><p><span>Otros indicadores acumulados habituales son los totales m&#243;viles y las medias m&#243;viles. De este modo, se habla de ventas TAM (</span><i>total-anual-m&#243;vil</i><span>) para referirse a las ventas de los &#250;ltimos 12 meses, o se habla de la venta media de los &#250;ltimos 7 d&#237;as... </span></p><p>Otros indicadores acumulados semejantes son los saldos. El saldo de una cuenta corriente no es la suma de los saldos de cada d&#237;a (es la suma de los movimientos desde el principio de la historia hasta la fecha estudiada). El personal de una empresa tampoco es la suma de las plantillas de cada mes... es la suma de las altas y bajas desde el principio de la historia.</p><p>Todos estos indicadores acumulados pueden ser definidos en el cat&#225;logo de Bingo Intelligence sin necesidad de tenerlos precalculados ni de modificar la base de datos.</p><p>Los pasos para definir estos indicadores son:</p><ul><li>Configurar la tabla de tiempo</li><li>Configurar las dimensiones de tiempo</li><li>Definir las “relaciones alternativas”</li><li>Definir los “indicadores acumulados”</li></ul><h3>Configurar la tabla de tiempo</h3><p><span>Para calcular los indicadores acumulados es necesario identificar la tabla de tiempo y definir una serie de filtros temporales. Para ello, se tiene que abrir el formulario de propiedades de la tabla de tiempo y rellenar la pesta&#241;a de configuraci&#243;n denominada </span><b>“Tabla de tiempo”</b><span>:</span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/propiedades-tabla-tiempo.png" alt="Es necesario definir los filtros de final de periodo en la tabla de tiempo." title="Es necesario definir los filtros de final de periodo en la tabla de tiempo." width="589" height="529" /></p><p><span>En ese formulario se han definido un conjunto de sentencias </span><i>WHERE </i><span>que permiten seleccionar el &#250;ltimo d&#237;a de diferentes periodos (el &#250;ltimo d&#237;a de la semana, el &#250;ltimo d&#237;a del mes, etc.).  Esta informaci&#243;n puede estar precalculada en campos booleanos de la tabla de tiempo (</span><i>ES_ULTIMO_DIA_SEMANA</i><span>, </span><i>ES_ULTIMO_DIA_MES</i><span>, etc.), o se puede utilizar el dialecto SQL de cada gestor de base de datos para calcularlo en funci&#243;n del resto de campos de la tabla de tiempo.</span></p><p><span>Estos filtros son necesarios para que Bingo Intelligence genere la sentencia SQL correcta independientemente del nivel de detalle solicitado. Por ejemplo, para calcular las ventas YTD </span><b>semana a semana</b><span>, se tienen que considerar todas las ventas desde el primer d&#237;a de a&#241;o, hasta el domingo de cada semana.</span></p><h3>Configurar las dimensiones de tiempo</h3><p><span>Adem&#225;s de configurar la tabla de tiempo, se tiene que indicar el “nivel de agregaci&#243;n” que representa cada dimensi&#243;n de tiempo del universo. En el </span><a href="http://help.bingointelligence.com/articulo.html?id=38">cat&#225;logo de LA_BIBLIO</a><span>, por ejemplo, se han definido estas dimensiones de tiempo:</span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/dimensiones-de-tiempo.png" alt="Estas son las dimensiones de tiempo definidas en el catálogo." title="Estas son las dimensiones de tiempo definidas en el catálogo." width="182" height="144" /></p><p><span>Para configurarlas se tiene que acceder a sus “</span><i><b>Propiedades</b></i><span>” y en la pesta&#241;a “</span><b>Avanzado</b><span>” indicar el nivel de agregaci&#243;n que cada dimensi&#243;n representa. De este modo se debe configurar la dimensi&#243;n “A&#241;o”:</span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/propiedades-dimension-tiempo.png" alt="Se ha de indicar el nivel de agregación temporal que representa cada dimensión de tiempo." title="Se ha de indicar el nivel de agregación temporal que representa cada dimensión de tiempo." width="632" height="478" /></p><p>Esta operaci&#243;n debe realizarse para todas las dimensiones de tiempo definidas en el cat&#225;logo.</p><p>Bingo Intelligence tendr&#225; en cuenta esta informaci&#243;n para aplicar el filtro adecuado (entre los definidos en la configuraci&#243;n de la tabla de tiempo) en funci&#243;n de las dimensiones incluidas en cada consulta.</p><h3>Definir las relaciones alternativas</h3><p><span>Para calcular un indicador YTD se debe relacionar cada fecha de la tabla de tiempo con todas los d&#237;as anteriores (del mismo a&#241;o) de la tabla de hechos. Esto se realiza definiendo una </span><b>“relaci&#243;n alternativa”</b><span> entre la tabla de tiempo y la tabla de hechos.</span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/relacion-ventas-tiempo.png" alt="Es necesario configurar la relación entre la tabla de tiempo y la tabla de hechos." title="Es necesario configurar la relación entre la tabla de tiempo y la tabla de hechos." width="522" height="339" /></p><p><span>Para definir la relaci&#243;n alternativa se debe abrir el formulario de </span><b>“Propiedades”</b><span> de esa relaci&#243;n (desde el men&#250; contextual situado en el centro de la relaci&#243;n). Las relaciones alternativas se administran desde la pesta&#241;a </span><b>“Relaciones alternativas”</b><span>.</span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/propiedades-relacion-admin-alternativas.png" alt="Las relaciones alternativas se administran desde el formulario de propiedades." title="Las relaciones alternativas se administran desde el formulario de propiedades." width="379" height="488" /></p><p><span>Para crear una relaci&#243;n alternativa se debe hacer clic en el bot&#243;n </span><b>“Nueva relaci&#243;n alternativa”, </b><span>y aparecer&#225; la siguiente ventana desde donde podremos modificar la relaci&#243;n:</span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/propiedades-relacion-alternativa.png" alt="Formulario de propiedades de la relqación alternativa." title="Formulario de propiedades de la relqación alternativa." width="513" height="327" /></p><p>En esta ventana se debe escribir la cl&#225;usula SQL que sustituir&#225; a la cl&#225;usula original. Bingo Intelligence utilizar&#225; esta relaci&#243;n cuando se necesario. </p><h3>Definir los indicadores acumulados</h3><p>El c&#225;lculo de los “indicadores acumulados” es transparente para el usuario. Los usuarios que generan los informes &#250;nicamente ven una serie de “indicadores acumulados”, y Bingo Intelligence gestiona &#237;ntegramente la generaci&#243;n del SQL, haciendo uso de los filtros de la tabla de tiempo y de las relaciones alternativas si es necesario, y sin ninguna intervenci&#243;n particular de los usuarios.</p><p>Para que Bingo Intelligence construya correctamente las sentencias SQL, el dise&#241;ador del cat&#225;logo debe indicar qu&#233; relaci&#243;n alternativa debe utilizar cada indicador. Esto se especifica desde el formulario de propiedades del indicador. Para ello, creamos un nuevo indicador, y lo definimos de esta manera:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/propiedades-indicador-acumulado.png" alt="Es necesario indicar la relación alternativa que debe utilizar cada indicador acumulado." title="Es necesario indicar la relación alternativa que debe utilizar cada indicador acumulado." width="616" height="472" /></p><p><span>En el momento de seleccionar la relaci&#243;n alternativa, aparecer&#225; un formulario con todas las relaciones del cat&#225;logo. Se debe buscar en esta lista la relaci&#243;n alternativa que se ha creado previamente. La relaci&#243;n alternativa aparecer&#225; dentro la relaci&#243;n entre la tabla de tiempo (</span><i>LB_TIEMPO</i><span>) y la tabla de hechos del indicador que estamos definiendo (</span><i>LB_VENTAS</i><span>).</span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/seleccionar-relacion-alternativa.png" alt="Se debe seleccionar la relación alternativa definida anteriormente." title="Se debe seleccionar la relación alternativa definida anteriormente." width="302" height="448" /></p><p>Una vez completados estos 4 pasos, los usuarios ya podr&#225;n utilizar este indicador, y Bingo Intelligence generar&#225; la sentencia SQL adecuada en cada caso.</p><p>Del mismo modo, se deben crear todos los indicadores acumulados que sean necesarios en el cat&#225;logo (Importe YTD, Ventas MTD, etc.).</p><h3>Verificaci&#243;n del c&#225;lculo de indicadores acumulados</h3><p><span>Para comprobar que Bingo Intelligence genera las sentencias SQL correctamente se puede utilizar el </span><a href="http://help.bingointelligence.com/articulo.html?id=43">“Probador de consultas”</a><span> . Sin embargo, en este caso, resulta m&#225;s c&#243;modo generar algunos informes utilizando este cat&#225;logo, y verificar la correcci&#243;n de los n&#250;meros obtenidos:</span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/informe-ytd.png" alt="Los indicadores acumulados se calculan correctamente." title="Los indicadores acumulados se calculan correctamente." width="601" height="650" /></p><p>Analizando los datos en pantalla se verifica que el c&#225;lculo se est&#225; realizando correctamente:</p><ul><li>Las ventas YTD en enero coinciden con las ventas de enero</li><li>Las ventas YTD en febrero, son las ventas de enero m&#225;s la de febrero.</li><li>Las ventas YTD de cada mes, son las ventas del mes, m&#225;s las ventas YTD del mes anterior.</li><li>En la visi&#243;n diaria, los datos tambi&#233;n est&#225;n bien calculados. Las ventas YTD del 1 de febrero, son las ventas YTD de enero m&#225;s las ventas de ese d&#237;a.</li><li>Adem&#225;s, aparecen tambi&#233;n los d&#237;as en que no se ha vendido (por ejemplo, el 3 de febrero).</li></ul><p>Tambi&#233;n podemos verificar que las sentencias SQL generadas son correctas. La consulta para obtener las ventas YTD mensuales es:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/sql-ytd-mensual.png" alt="SELECT
   cast(LB_TIEMPO.ANYO as char(4)) AS Ano,
   LB_TIEMPO.NOMBRE_MES AS Mes,
   LB_TIEMPO.MES AS bi_orderby_Mes,
   sum(LB_VENTAS.UNIDADES) AS UnidadesYtd
FROM LB_VENTAS_DIARIAS LB_VENTAS
INNER JOIN dbo.LB_TIEMPO LB_TIEMPO ON (year(LB_VENTAS.FECHA)=year(LB_TIEMPO.FECHA) AND LB_VENTAS.FECHA&lt;=LB_TIEMPO.FECHA)
WHERE
   cast(LB_TIEMPO.ANYO as char(4))=&#39;2008&#39;
   AND day(LB_TIEMPO.FECHA+1)=1
GROUP BY
   cast(LB_TIEMPO.ANYO as char(4)),
   LB_TIEMPO.NOMBRE_MES,
   LB_TIEMPO.MES
" title="SELECT
   cast(LB_TIEMPO.ANYO as char(4)) AS Ano,
   LB_TIEMPO.NOMBRE_MES AS Mes,
   LB_TIEMPO.MES AS bi_orderby_Mes,
   sum(LB_VENTAS.UNIDADES) AS UnidadesYtd
FROM LB_VENTAS_DIARIAS LB_VENTAS
INNER JOIN dbo.LB_TIEMPO LB_TIEMPO ON (year(LB_VENTAS.FECHA)=year(LB_TIEMPO.FECHA) AND LB_VENTAS.FECHA&lt;=LB_TIEMPO.FECHA)
WHERE
   cast(LB_TIEMPO.ANYO as char(4))=&#39;2008&#39;
   AND day(LB_TIEMPO.FECHA+1)=1
GROUP BY
   cast(LB_TIEMPO.ANYO as char(4)),
   LB_TIEMPO.NOMBRE_MES,
   LB_TIEMPO.MES
" width="634" height="161" /></p><p><span>En la anterior consulta se ve que, efectivamente, se ha utilizado la </span><b>relaci&#243;n alternativa</b><span>, y que se ha incluido el filtro para mostrar las ventas acumuladas hasta el </span><b>&#250;ltimo d&#237;a del mes</b><span>.</span></p><p>La consulta para obtener las ventas YTD diarias del mes de febrero es:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/sql-ytd-diario.png" alt="SELECT
   LB_TIEMPO.FECHA AS Fecha,
   sum(LB_VENTAS.UNIDADES) AS UnidadesYtd
FROM LB_VENTAS_DIARIAS LB_VENTAS
INNER JOIN dbo.LB_TIEMPO LB_TIEMPO ON (year(LB_VENTAS.FECHA)=year(LB_TIEMPO.FECHA) AND LB_VENTAS.FECHA&lt;=LB_TIEMPO.FECHA)
WHERE
   LB_TIEMPO.NOMBRE_MES=&#39;Febrero&#39;
   AND cast(LB_TIEMPO.ANYO as char(4))=&#39;2008&#39;
GROUP BY
   LB_TIEMPO.FECHA
" title="SELECT
   LB_TIEMPO.FECHA AS Fecha,
   sum(LB_VENTAS.UNIDADES) AS UnidadesYtd
FROM LB_VENTAS_DIARIAS LB_VENTAS
INNER JOIN dbo.LB_TIEMPO LB_TIEMPO ON (year(LB_VENTAS.FECHA)=year(LB_TIEMPO.FECHA) AND LB_VENTAS.FECHA&lt;=LB_TIEMPO.FECHA)
WHERE
   LB_TIEMPO.NOMBRE_MES=&#39;Febrero&#39;
   AND cast(LB_TIEMPO.ANYO as char(4))=&#39;2008&#39;
GROUP BY
   LB_TIEMPO.FECHA
" width="636" height="115" /></p><p><span>En este caso la consulta tambi&#233;n es correcta. Se ha incluido la </span><b>relaci&#243;n alternativa, </b><span>y no ha sido necesario incluir el </span><b>filtro del &#250;ltimo d&#237;a del periodo </b><span>(ya que en este caso la consulta incluye el detalle diario).</span></p><p>Del mismo modo, se pueden a&#241;adir otras dimensiones o filtros en la consulta. Con este mismo indicador YTD, se podr&#237;an calcular las ventas YTD de una determinada editorial o de un conjunto de tiendas... tanto a nivel diario, semanal, o mensual... y Bingo Intelligence generar&#225; la consulta adecuada en cada caso.</p><p>Este m&#233;todo es muy flexible y puede ser &#250;til para muchas necesidades habituales. Sin embargo, el rendimiento puede verse penalizado si la tabla de hechos tiene muchos millones de registros. En este caso, se debe considerar la creaci&#243;n de tablas agregadas. De hecho, en este ejemplo, las dos consultas se han aprovechado de la existencia de la tabla agregada LB_VENTAS_DIARIAS.  </p></div></div></div>]]></description><pubDate>Mon, 20 Sep 2010 09:51:08 +0100</pubDate><guid isPermaLink="true">http://localhost/</guid></item><item><title>Cómo se generan las sentencias SQL</title><link>http://localhost/</link><description><![CDATA[<div style="width:700px"><div class="contenido"><div><h3>Generaci&#243;n autom&#225;tica de sentencias SQL</h3><p><span>Los usuarios construyen las consultas arrastrando las dimensiones, indicadores y filtros desde el cat&#225;logo hasta el informe. Con esta informaci&#243;n, Bingo Intelligence genera autom&#225;ticamente las </span><i>queries</i><span> necesarias para obtener el resultado correcto.</span></p><p>Para construir las sentencias SQL, Bingo Intelligence tiene en cuenta:</p><ul><li>Las dimensiones, indicadores y filtros seleccionados en la consulta. Esto determina fundamentalmente la cl&#225;usula SELECT y WHERE.</li><li>En la cl&#225;usula FROM se incluyen todas las tablas referenciadas en los objetos anteriores.</li><li>Se buscan todas las relaciones necesarias para incluir todas las tablas anteriores.</li><li>Se incluyen todas las tablas que se mencionan en las relaciones seleccionadas.</li><li>Si en este proceso Bingo detecta que se han seleccionado varias tablas de hecho, o varios indicadores con distintos filtros, entonces se generan tantas sentencias SQL como sean necesarias.</li><li>Finalmente, se ejecuta la consulta o consultas generadas, y se sincronizan los resultados, ofreciendo al usuario un &#250;nico resultado en forma tabular.</li></ul><h3>El probador de consultas SQL</h3><p>El probador de consultas SQL es una herramienta del “Dise&#241;ador de cat&#225;logos” que permite verificar el modo en que Bingo Intelligence construye cualquier consulta.</p><p>Para abrir esta herramienta se debe seleccionar la opci&#243;n “Probar consulta sobre este cat&#225;logo” situada en el men&#250; “Herramientas”.</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/probador-consultas-sql.png" alt="El editor de consultas permite definir una consulta y verificar el SQL generado." title="El editor de consultas permite definir una consulta y verificar el SQL generado." width="381" height="529" /></p><p>Esta ventana sirve para definir la consulta, y es la misma que se utiliza en otros lugares de Bingo Intelligence para definir una consulta.</p><p>La consulta se define arrastrando las dimensiones, indicadores y filtros en los distintos paneles:</p><ul><li>En el panel “Consulta” se tienen que incluir las dimensiones e indicadores que se quiere que aparezcan como “columnas” en el resultado.</li><li>En el panel “Filtro” se tienen que arrastrar los elementos que queremos filtrar. Si se arrastra un indicador o una dimensi&#243;n, aparecer&#225; un di&#225;logo adicional para definir exactamente las propiedades de este filtro.</li><li>En el panel “Ordenaci&#243;n” se debe especificar el orden en que debe aparecer el resultado.</li></ul><p>Se puede comprobar la consultas o consultas generadas pulsando el bot&#243;n “SQL”.</p><p><span>El probador de consultas s&#243;lo sirve para verificar la generaci&#243;n de las sentencias SQL, pero no es posible ejecutar propiamente la consulta generada. Para ello, es necesario </span><a href="http://help.bingointelligence.com/articulo.html?id=2">crear una aplicaci&#243;n y definir un informe</a><span>.</span></p></div></div></div>]]></description><pubDate>Sat, 18 Sep 2010 12:55:05 +0100</pubDate><guid isPermaLink="true">http://localhost/</guid></item><item><title>¿Qué es un catálogo?</title><link>http://localhost/</link><description><![CDATA[<div style="width:700px"><div class="contenido"><div><h3>Definici&#243;n</h3><p><span>Los cat&#225;logos son la </span><b>capa sem&#225;ntica</b><span> de Bingo Intelligence y permiten a los usuarios realizar consultas sin tener conocimientos t&#233;cnicos sobre la estructura de la base de datos ni el lenguaje SQL.</span></p><p>Gracias a los cat&#225;logos de Bingo Intelligence, los usuarios tienen una visi&#243;n natural de sus datos de negocio, con una estructura y una terminolog&#237;a que les resulta familiar y f&#225;cil de utilizar.</p><h3>Visi&#243;n de usuario</h3><p><span>En el interfaz de usuario de Bingo An&#225;lisis el </span><i>creador de informes</i><span> accede a las dimensiones, indicadores y filtros desde el panel de navegaci&#243;n.  Al pulsar el bot&#243;n “Datos”, el usuario tiene acceso a todos los elementos organizados por carpetas, y &#250;nicamente debe arrastrarlos a su informe para crear las consultas.</span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/catalogo-usuario.png" alt="El usuario únicamente tiene acceso a las dimensiones, indicadores y filtros definidos en el catálogo." title="El usuario únicamente tiene acceso a las dimensiones, indicadores y filtros definidos en el catálogo." width="567" height="304" /></p><h3>Dise&#241;ador de cat&#225;logos</h3><p>El dise&#241;ador de cat&#225;logos es la interfaz que ofrece Bingo An&#225;lisis para crear, modificar y administrar los cat&#225;logos. Al crear un nuevo cat&#225;logo, o al abrir uno existente, Bingo An&#225;lisis muestra el dise&#241;ador de cat&#225;logos:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/disenyador-catalogos.png" alt="Elementos del Diseñador de Catálogos" title="Elementos del Diseñador de Catálogos" width="567" height="412" /></p><p>En el dise&#241;ador de cat&#225;logos existen los siguientes elementos:</p><ul><li><b>Diagrama de tablas:</b><span> Muestra las tablas y relaciones de la base de datos.</span></li><li><b>Pesta&#241;as: </b><span>El cat&#225;logo puede tener varios diagramas y se puede acceder a ellos a trav&#233;s de las pesta&#241;as situados en el lateral inferior. </span></li><li><b>Panel de navegaci&#243;n: </b><span>En</span><b> </b><span>el lateral izquierdo, existe un panel de navegaci&#243;n que muestra en forma jer&#225;rquica los diferentes objetos del cat&#225;logo (objetos de negocio que ver&#225;n los usuarios, tablas de la base de datos, tablas importadas, etc.)</span></li><li><b>Men&#250;s:</b><span> Incluye las opciones generales de Bingo Intelligence (abrir, guardar...) y algunas espec&#237;ficas del “Dise&#241;ador de cat&#225;logo” (propiedades del cat&#225;logo, conexiones, ...).</span></li><li><b>Botones de navegaci&#243;n:</b><span> Permite seleccionar el panel de navegaci&#243;n visible.</span></li></ul><h3>Caracter&#237;sticas avanzadas</h3><p>Los cat&#225;logos de Bingo Intelligence incluyen las siguientes caracter&#237;sticas avanzadas:</p><ul><li><span>Posibilidad de conexi&#243;n </span><b>a cualquier base de datos relacional</b><span></span></li><li>Posibilidad para definir y organizar libremente las dimensiones, indicadores y filtros (con independencia de la estructura de la base de datos).</li><li>Uso del dialecto propio de cada gestor de base de datos.</li><li><b>Sin restricciones en el modelo de datos</b><span> (admite modelos en estrella, normalizados, copo de nieve, o cualquier otro). </span></li><li><b>Multiconsulta</b><span>: Si no es posible obtener los datos solicitados en una &#250;nica consulta, Bingo Intelligence generar&#225; el n&#250;mero de consultas que sea necesario para obtener los resultados.</span></li><li><b>Sincronizaci&#243;n</b><span> de diferentes consultas para mostrar un &#250;nico resultado al usuario</span></li><li>Libertad para definir las relaciones entre tablas (incluso mediante relaciones personalizadas y no est&#225;ndar).</li><li>Listas de valores de las dimensiones</li><li>Filtros avanzados (mes anterior, mes equivalente, P1, periodo variable, ...)</li><li><b>Indicadores avanzados</b><span> (year-to-date, month-to-date, saldos, acumulados,...)</span></li><li>Ordenaciones personalizadas</li><li><b>Uso de tablas agregadas</b><span> (reescritura de consulta)</span></li><li>Relaciones alternativas </li><li>Tablas derivadas</li><li><b>Seguridad horizontal</b><span> (para poder limitar la informaci&#243;n a la que tiene acceso cada usuario).</span></li><li>Data-profiling de tablas y dimensiones</li><li>Detecci&#243;n de cambios en la estructura de la base de datos</li><li>Verificaci&#243;n de la integridad de los datos y la correcci&#243;n de las relaciones</li></ul><h3>Siguientes pasos</h3><p><span>En el art&#237;culo sobre </span><a href="http://help.bingointelligence.com/articulo.html?id=38">c&#243;mo crear un cat&#225;logo</a><span>, y en resto de apartados de este manual, se introducen y explican con mayor detalle estas funcionalidades.</span></p></div></div></div>]]></description><pubDate>Thu, 16 Sep 2010 20:46:44 +0100</pubDate><guid isPermaLink="true">http://localhost/</guid></item><item><title>¿Cómo se instala la aplicación de ejemplo LA BIBLIO?</title><link>http://localhost/</link><description><![CDATA[<div style="width:700px"><div class="contenido"><div><h3>LA BIBLIO</h3><p><i>LA BIBLIO</i><span> es una </span><b>aplicaci&#243;n</b><span> de ejemplo que incluye Bingo Intelligence para poder dar los primeros pasos con la plataforma. Con este ejemplo, se puede experimentar sobre c&#243;mo construir un cuadro de mando , y conocer todas las funcionalidades de esta aplicaci&#243;n de </span><b>Business Intelligence</b><span>.</span></p><p><span>Como toda aplicaci&#243;n de Bingo Intelligence, este ejemplo utiliza un </span><b>cat&#225;logo</b><span> para acceder a la base de datos. Gracias al cat&#225;logo, el usuario final no necesita conocer la estructura de la base de datos ni el lenguaje SQL, y puede construir informes arrastrando las dimensiones e indicadores que quiere incluir en su informe.</span></p><p>El cat&#225;logo de la BIBLIO tambi&#233;n sirve de ejemplo para conocer c&#243;mo funcionan y c&#243;mo se construyen los cat&#225;logos de Bingo Intelligence.</p><p><b>Para poder hacer servir este ejemplo es necesario instalar la base de datos BI_BIBLIO en un servidor SQL Server. </b><span>Evidentemente, puede instalarse en el mismo servidor donde se encuentra el repositorio de Bingo Intelligence, aunque puede importarse en cualquier otro servidor que sea accesible desde el servidor Bingo.</span></p><h3>Instalar la base de datos BI_BIBLIO</h3><p>Para realizar la instalaci&#243;n de esta base de datos de ejemplo, conviene estar familiarizado con la administraci&#243;n de bases de datos SQL Server. </p><p>El proceso de instalaci&#243;n es sencillo. S&#243;lo hace falta descargarse una copia de la base de datos, y restaurarla en una base de datos vac&#237;a. </p><p><span>En primer lugar, se tiene que descargar la copia correspondiente a la versi&#243;n de </span><i>SQL Server</i><span> donde se quiere instalar la base de datos:</span></p><ul><li><a href="http://help.bingointelligence.com/databases/BI_BIBLIO-2008-R2.zip">Copia de seguridad de BI_BIBLIO (para Microsoft SQL Server 2008 R2)</a><span></span></li><li><a href="http://help.bingointelligence.com/databases/BI_BIBLIO-2008.zip">Copia de seguridad de BI_BIBLIO (para Microsoft SQL Server 2008)</a><span></span></li><li><a href="http://help.bingointelligence.com/databases/BI_BIBLIO-2005.zip">Copia de seguridad de BI_BIBLIO (para Microsoft SQL Server 2005)</a><span></span></li></ul><p>Una vez descargada la copia adecuada, los pasos a seguir son:</p><ul><li>Descomprimir el fichero BI-BIBLIO.BAK del archivo ZIP reci&#233;n descargado</li><li>Abrir el “SQL Server Management Studio”</li><li>Crear una base de datos nueva llamada BI_BIBLIO.</li><li>Sobre la base de datos reci&#233;n creada, seleccionar la opci&#243;n “Tareas/Restaurar/Base de datos”, y se abrir&#225; el formulario de restauraci&#243;n de bases de datos.</li></ul><p>En este formulario, se tiene que seleccionar la copia que hemos descargado previamente (con extensi&#243;n .BAK), y seleccionar la opci&#243;n de sobrescribir la base de datos existente, tal y como muestran las siguientes im&#225;genes:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/restauracion-bi-biblio0.png" alt="Se debe seleccionar la base de datos descargada previamente." title="Se debe seleccionar la base de datos descargada previamente." width="521" height="480" /></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/restauracion-bi-biblio1.png" alt="Para que los archivos de base de datos se coloquen en la ubicación adecuada, es necesario sobreescribir la base de datos existente (que acabamos de crear)." title="Para que los archivos de base de datos se coloquen en la ubicación adecuada, es necesario sobreescribir la base de datos existente (que acabamos de crear)." width="488" height="461" /></p><p>Al finalizar la restauraci&#243;n, debe aparecer este mensaje:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/restauracion-ok.png" alt="Finalizó correctamente la restauración de la base de datos &quot;BI-BIBLIO&quot;" title="Finalizó correctamente la restauración de la base de datos &quot;BI-BIBLIO&quot;" width="474" height="105" /></p><p><span>Una vez restaurada la base de datos, se tiene que crear el “inicio de sesi&#243;n” que utilizar&#225; Bingo  para conectarse. Este usuario &#250;nicamente necesita </span><b>acceso de lectura</b><span> a la base de datos:</span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/inicio-sesion-biblio.png" alt="El usuario necesita permisos de lectura sobre la base de datos." title="El usuario necesita permisos de lectura sobre la base de datos." width="417" height="374" /></p><h3>Configuraci&#243;n de la conexi&#243;n desde Bingo An&#225;lisis</h3><p>Una vez creada la base de datos, se tiene que configurar la conexi&#243;n que utiliza el cat&#225;logo “LA BIBLIO” para conectarse a la base de datos. </p><p><span>Para modificar la conexi&#243;n, se debe abrir Bingo An&#225;lisis, y seleccionar la opci&#243;n “</span><b>Bases de datos/Administraci&#243;n de tecnolog&#237;as</b><span>” del men&#250; “Herramientas”.</span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/admin-tecnologias.png" alt="Administrador de tecnologías" title="Administrador de tecnologías" width="302" height="448" /></p><p>Con el bot&#243;n derecho, podemos acceder a las propiedades de ese “servidor”, y configurar las propiedades de conexi&#243;n de esa base de datos:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/propiedades-conexion.png" alt="Se deben introducir los parámetros de conexión adecuados." title="Se deben introducir los parámetros de conexión adecuados." width="416" height="616" /></p><p>Si se han realizado correctamente los pasos anteriores, debe aparecer el siguiente mensaje al hacer un “test” de la conexi&#243;n.</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/conexion-bi-biblio-ok.png" alt="La conexión se ha establecido correctamente." title="La conexión se ha establecido correctamente." width="357" height="171" /></p><h3>Verificaci&#243;n de la instalaci&#243;n</h3><p><span>En este momento, ya se puede verificar que todo est&#225; funcionando adecuadamente. Para ello, podemos abrir cualquier informe de la aplicaci&#243;n </span><b>LA BIBLIO</b><span>, y comprobar si efectivamente se muestra informaci&#243;n:</span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/aplicacion-la-biblio.png" alt="La aplicación LA BIBLIO debe mostrar datos." title="La aplicación LA BIBLIO debe mostrar datos." width="589" height="429" /></p><p>Para mostrar estos datos, el cliente ha realizado la petici&#243;n al servidor de Bingo Intelligence, y &#233;ste ha realizado la consulta a la base de datos con los par&#225;metros de conexi&#243;n que se han definido. Las consultas a la base de datos siempre las realiza el servidor Bingo, por lo que es posible acceder a estos informes incluso remotamente, y sin conexi&#243;n directa con la base de datos.</p></div></div></div>]]></description><pubDate>Mon, 13 Sep 2010 23:44:20 +0100</pubDate><guid isPermaLink="true">http://localhost/</guid></item><item><title>Uso de tablas agregadas</title><link>http://localhost/</link><description><![CDATA[<div style="width:700px"><div class="contenido"><div><h3>Necesidad de las tablas agregadas</h3><p>Las tablas agregadas sirven para mejorar los tiempos de respuesta de las consultas. </p><p>Existen muchos factores que influyen en el rendimiento de las consultas. Para obtener un buen rendimiento es necesario, entre otras cosas, un buen dise&#241;o del modelo de datos y la creaci&#243;n de &#237;ndices sobre aquellos campos muy selectivos que se filtran habitualmente. Sin embargo, este tipo de t&#233;cnicas no son suficientes cuando se trabaja con bases de datos con muchos millones de registros y se requiere unos tiempos de respuesta reducidos.</p><p>Inevitablemente, al aumentar el n&#250;mero de registros que contienen las tablas se penaliza el tiempo requerido para resolver las consultas. Cuando las tablas son grandes, el gestor de base de datos debe leer millones de registros para seleccionar unos pocos y finalmente agruparlos.</p><p>Para evitar estas situaciones, el dise&#241;ador de la base de datos puede preparar tablas agregadas que contienen la misma informaci&#243;n que las tablas detalladas, pero con menor nivel de detalle y con los datos ya sumarizados.</p><p><span>En la base de datos de </span><a href="http://help.bingointelligence.com/articulo.html?id=41">LA BIBLIO</a><span>, por ejemplo, la tabla de ventas tiene varios millones de registros. </span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/tabla-detalle-ventas.png" alt="Diagrama con 7 tablas relacionadas" title="Diagrama con 7 tablas relacionadas" width="554" height="356" /></p><p><span>La tabla de ventas de este cat&#225;logo contiene todas las ventas, de todas las tiendas, de todos los libros, d&#237;a a d&#237;a. Sin embargo, los responsables comerciales que utilizan </span><i><b>Bingo An&#225;lisis</b></i><span> para acceder a su informaci&#243;n corporativa no suelen necesitar tanto nivel de detalle. Habitualmente, consultan los totales de ventas de sus tiendas, por meses, por semanas, o por fechas. Y raramente consultan el detalle de los libros.</span></p><p><span>&#191;No se podr&#237;a aprovechar esta circunstancia para mejorar el rendimiento de estas consultas habituales? S&#237;. En el cat&#225;logo de Bingo Intelligence </span><b>se pueden incluir las tablas agregadas, y el generador de consultas SQL las utilizar&#225; cuando sea posible.</b><span></span></p><h3>Crear una tabla agregada</h3><p><b>Bingo Intelligence no crea las tablas agregadas.</b><span> Es responsabilidad del dise&#241;ador de la base de datos crear y mantener las tablas agregadas que sean necesarias, e incluirlas en cat&#225;logo.</span></p><p>Para crear la tabla agregada se deben tener en cuenta estas consideraciones:</p><ul><li>S&#243;lo se deben crear aquellas tablas agregadas que sean necesarias. Una tabla agregada es un objeto m&#225;s a mantener, por lo que s&#243;lo se deber&#237;a crear si permite mejorar el rendimiento de un n&#250;mero significativo de consultas.</li><li><b>El nombre de los campos de la tabla agregada debe coincidir con el nombre de los campos equivalentes de la tabla detallada.</b></li></ul><p>Bingo Intelligence utilizar&#225; la tabla agregada cuando todos los campos de la tabla detallada que se mencionan en una consulta SQL aparecen tambi&#233;n en la tabla agregada. En caso de que existan varias tablas agregadas que cumplan esta condici&#243;n, se seleccionar&#225; aquella que tenga un menor n&#250;mero de registros.</p><p>En la base de datos de ejemplo, la tabla LB_VENTAS_DIARIAS es una tabla agregada de LB_VENTAS:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/tabla-agregada-venta.png" alt="Comparación de las tablas LB_VENTAS y LB_VENTAS_DIARIAS" title="Comparación de las tablas LB_VENTAS y LB_VENTAS_DIARIAS" width="454" height="175" /></p><p>Como se ve en la imagen, la tabla “Ventas diarias” tiene los mismos campos que la tabla de “Ventas”, excepto el campo “ID_LIBRO”. La tabla detallada tiene varios millones de registros, mientras que la tabla agregada tiene varias decenas de miles... Evidentemente, las consultas contra LB_VENTAS_DIARIAS ir&#225;n significativamente m&#225;s r&#225;pidas.</p><h3>Incluir la tabla agregada en el cat&#225;logo</h3><p><b>Para que Bingo Intelligence haga uso de la tabla agregada es necesario importarla en el cat&#225;logo, e indicarle que se trata de una tabla agregada.</b></p><p><span>Para importar la tabla agregada se tiene que ir al panel de navegaci&#243;n de Bases de datos, y seleccionar la opci&#243;n “</span><b>Importar tabla</b><span>” del men&#250; contextual (bot&#243;n derecho).</span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/importar-tabla.png" alt="Importar tabla desde el panel de navegación" title="Importar tabla desde el panel de navegación" width="519" height="394" /></p><p><b>Al importar una tabla no se a&#241;ade autom&#225;ticamente en el diagrama de tablas. </b><span>Para definir una tabla agregada, no es necesario que &#233;sta aparezca en el diagrama. Es suficiente que est&#233; importada en el cat&#225;logo y que Bingo Intelligence conozca su estructura.</span></p><p>Para indicar que se trata de una tabla agregada es necesario modificar sus propiedades. Para ello, se ha de desplegar la pesta&#241;a de “Tablas importadas”, y abrir sus “Propiedades”:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/abrir-propiedades-tabla.png" alt="Abrir propiedades desde el panel de navegación" title="Abrir propiedades desde el panel de navegación" width="520" height="420" /></p><p>En el formulario de propiedades se tiene que indicar que esta tabla es una tabla agregada de la tabla de detalle denominada “LB_VENTAS”:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/propiedades-tabla-agregada.png" alt="Configuración de la tabla agregada. Se debe indicar cual es su tabla de detalle." title="Configuración de la tabla agregada. Se debe indicar cual es su tabla de detalle." width="567" height="371" /></p><p>Resumiendo, para que Bingo Intelligence utilice las tablas agregadas s&#243;lo es necesario:</p><ul><li>Importar la tabla agregada</li><li>En sus propiedades, indicar cu&#225;l es la tabla de detalle que resume</li></ul><p>En concreto, no es necesario modificar el diagrama de tablas, ni la definici&#243;n de ning&#250;n indicador, ni las propiedades de la tabla de detalle.</p><h3>Verificaci&#243;n de la configuraci&#243;n de la tabla agregada</h3><p>Es recomendable verificar que la configuraci&#243;n se ha realizado correctamente y que Bingo Intelligence utilizar&#225; la tabla agregada cuando se posible.</p><p><span>Para ello, se puede utilizar el </span><a href="http://help.bingointelligence.com/articulo.html?id=43">“Probador de consultas SQL”</a><span> para definir esta consulta:</span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/consuta-agregada1.png" alt="Consulta que utilizará la tabla agregada" title="Consulta que utilizará la tabla agregada" width="396" height="529" /></p><p><span>Con el bot&#243;n “</span><b>SQL</b><span>” se puede verificar la sentencia:</span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/sql-con-tabla-agregada.png" alt="SQL que muestra el modo en que Bingo Intelligence incluye las tablas agregadas." title="SQL que muestra el modo en que Bingo Intelligence incluye las tablas agregadas." width="419" height="125" /></p><p><span>Efectivamente, se observa que se ha incluido la tabla “LB_VENTAS_DIARIAS”  (y que en esta sentencia tiene el </span><i>alias</i><span> de “LB_VENTAS”). </span></p><p>Para terminar la verificaci&#243;n, se puede incluir la “Editorial” en la consulta, por lo que ya no ser&#225; posible utilizar la tabla agregada, y la consulta generada ser&#225;:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/sql-sin-tabla-agregada.png" alt="Esta consulta NO se puede resolver con la tabla agregada" title="Esta consulta NO se puede resolver con la tabla agregada" width="466" height="159" /></p><p><span>De esta manera, los usuarios podr&#225;n utilizar las tablas agregadas de un </span><b>modo transparente</b><span>, y siempre obtendr&#225;n el resultado correcto, y de la manera m&#225;s </span><b>eficiente</b><span> posible.</span></p></div></div></div>]]></description><pubDate>Mon, 06 Sep 2010 00:22:47 +0100</pubDate><guid isPermaLink="true">http://localhost/</guid></item><item><title>Primeros pasos con el diseñador de catálogos</title><link>http://localhost/</link><description><![CDATA[<div style="width:700px"><div class="contenido"><div><h3>Pasos para crear un cat&#225;logo</h3><p>Los pasos para crear un cat&#225;logo de Bingo Intelligence son:</p><ul><li><b>Establecer la conexi&#243;n</b><span> con el servidor de datos</span></li><li><b>Crear el diagrama de tablas</b><span>, a&#241;adiendo las tablas, y creando las relaciones entre ellas.</span></li><li><b>Crear las dimensiones, indicadores y filtros</b><span> que tendr&#225;n los usuarios para definir sus informes.</span></li><li><b>Organizar en carpetas las dimensiones, indicadores y filtros</b><span> del cat&#225;logo, para que resulte f&#225;cil a los usuarios localizarlos y trabajar con los diferentes elementos.</span></li><li><b>Verificar </b><span>el correcto funcionamiento del sistema.</span></li></ul><p>La creaci&#243;n de un cat&#225;logo es un proceso relativamente sencillo, sin embargo, conviene conocer el modelo de datos de la base de datos, y tener conocimientos sobre modelizaci&#243;n de datos y algunas nociones sobre el lenguaje SQL.</p><p>En los siguientes apartados se describe con m&#225;s detalle este proceso.</p><h3>Crear un “nuevo cat&#225;logo”</h3><p><span>Para empezar se debe seleccionar la opci&#243;n “</span><i><b>Nuevo cat&#225;logo</b></i><span>” del men&#250; “</span><i>Archivo</i><span>”. Aparecer&#225; el formulario de propiedades generales del cat&#225;logo.</span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/propiedades-catalogo.png" alt="En este formulario debemos establecer el nombre del catálogo, y seleccionar la conexión." title="En este formulario debemos establecer el nombre del catálogo, y seleccionar la conexión." width="567" height="362" /></p><p>En este formulario debemos indicar un nombre para este nuevo cat&#225;logo, y debemos seleccionar la base de datos a la que nos conectaremos.</p><p>Cada cat&#225;logo necesita tener definida una, y s&#243;lo una, conexi&#243;n. Bingo Intelligence se conectar&#225; a ese servidor para obtener la estructura de la base de datos y, posteriormente, se conectar&#225; para ejecutar las consultas de los usuarios.</p><p><span>En este ejemplo utilizaremos la conexi&#243;n a la base de datos de ejemplo </span><b>BI_BIBLIO</b><span>.  Si a&#250;n no tienes esta base de datos instalada en tu organizaci&#243;n, puedes consultar el art&#237;culo sobre </span><a href="http://help.bingointelligence.com/articulo.html?id=41">c&#243;mo instalar “LA BIBLIO”</a><span>. Si quieres que el cat&#225;logo se conecte a otra base de datos,  deber&#225;s </span><a href="http://help.bingointelligence.com/articulo.html?id=37">crear una nueva conexi&#243;n desde el “Administrador de tecnolog&#237;as”</a><span>.</span></p><p>Una vez seleccionado el servidor de datos, se debe hacer clic en el bot&#243;n “Aceptar”, y se abrir&#225; el “Dise&#241;ador de cat&#225;logos”:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/disenyador-catalogos-nuevo.png" alt="Inicialmente el diseñador de catálogos no muestra ninguna tabla" title="Inicialmente el diseñador de catálogos no muestra ninguna tabla" width="543" height="393" /></p><h3>Crear el diagrama de tablas</h3><p>Inicialmente, tal y como aparece en la imagen superior, el cat&#225;logo est&#225; vac&#237;o. No tiene ninguna tabla ni ning&#250;n objeto creado.</p><p><span>Para continuar con la construcci&#243;n del cat&#225;logo, se debe crear el </span><b>diagrama de tablas.</b><span> Para ello, es necesario arrastrar las tablas desde el “Panel de navegaci&#243;n de bases de datos” hasta el diagrama de tablas (en el &#225;rea principal de la aplicaci&#243;n).</span></p><p><span>Para ver las tablas existentes en la base de datos, se debe pulsar el bot&#243;n “</span><b>Bases de datos</b><span>”, y abrir la pesta&#241;a “</span><b>Servidor</b><span>”:</span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/panel-bases-de-datos.png" alt="El panel de navegación muestra las tablas y campos de la base de datos." title="El panel de navegación muestra las tablas y campos de la base de datos." width="408" height="434" /></p><p><span>En el panel de navegaci&#243;n deben aparecer las bases de datos y desplegando el &#225;rbol se muestran las tablas, vistas y campos existentes. En caso contrario, se debe </span><a href="http://help.bingointelligence.com/articulo.html?id=37">verificar la conexi&#243;n desde el “Administrador de tecnolog&#237;as”</a><span> y se debe verificar que en la ventana de propiedades del cat&#225;logo se ha seleccionado la conexi&#243;n correcta.</span></p><p><b>La tablas se incluyen en el diagrama mediante drag&amp;drop desde el panel de navegaci&#243;n.</b><span>  De esta manera, podemos incluir, por ejemplo, las tablas de “ventas”, “tiendas”, “tiempo” y “libros” de la base de datos de ejemplo.</span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/disenyador-catalogo-con-tablas.png" alt="Las tablas se incluyen en el diagrama arrastrándolas desde el panel de navegación." title="Las tablas se incluyen en el diagrama arrastrándolas desde el panel de navegación." width="522" height="383" /></p><p>Bingo Intelligence no importa las relaciones autom&#225;ticamente. Conociendo el modelo de datos, se tienen que crear las relaciones mediante “drag&amp;drop”. Por ejemplo, para crear la relaci&#243;n entre la tabla de “ventas” y la tabla de “tiendas”, se debe arrastrar el campo “ID_TIENDA” de la tabla de ventas, al campo “ID_TIENDA” de la tabla de tiendas. Del mismo modo, podemos hacer la relaci&#243;n con las tablas de libros y fechas.</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/diagrama-4-tablas.png" alt="Diagrama de 4 tablas relacionadas" title="Diagrama de 4 tablas relacionadas" width="494" height="386" /></p><p><span>Al crear las relaciones, el dise&#241;ador de cat&#225;logos mostrar&#225; un “flecha” indicando la relaci&#243;n. </span><b>El sentido de la relaci&#243;n es muy importante</b><span>, y determinar&#225; el modo en que Bingo Intelligence construye las sentencias SQL.  La relaci&#243;n siempre ha de ser desde la tabla m&#225;s detallada hasta la tabla m&#225;s “resumida”. Normalmente, </span><b>el extremo de la “flecha” coincidir&#225; con la clave primaria de una tabla de dimensi&#243;n.</b></p><p>Si necesitamos modificar o eliminar una relaci&#243;n, podemos hacerlo desde el men&#250; contextual (bot&#243;n derecho del rat&#243;n) situado en el centro de la relaci&#243;n.</p><p><span>Bingo Intelligence admite cualquier modelo de datos. Se puede representar un </span><i>modelo en estrella</i><span> (como en la imagen superior), un </span><i>modelo en copo de nieve</i><span>, un modelo normalizado, o cualquier otro modelo que est&#233; creado en la base de datos. De todos modos, se debe tener en cuenta que </span><b>el rendimiento de las aplicaciones de Bingo Intelligence depende directamente del rendimiento de la base de datos subyacente</b><span>. </span></p><p>En este caso, completaremos el diagrama de esta “estrella” a&#241;adiendo las tablas de “categor&#237;as de libros” e “idiomas”.</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/diagrama-tabla-bi-biblio.png" alt="Diagrama con 7 tablas relacionadas" title="Diagrama con 7 tablas relacionadas" width="554" height="356" /></p><h3>Crear las dimensiones, indicadores y filtros</h3><p>Una vez que se tiene el diagrama de tablas preparado ya se pueden crear los elementos que ver&#225;n los usuarios.  Existen tres tipos de elementos que se deber&#225;n definir:</p><ul><li><b>Dimensiones. </b><span>Son los conceptos que se utilizan para filtrar, segmentar o agrupar la informaci&#243;n en los informes corporativos. Dimensiones habituales son “Clientes”, “Nacionalidad”, “Productos”, “Familias de productos”, etc. Habitualmente, son elementos alfanum&#233;ricos, y se incluyen en las cl&#225;usulas </span><i>SELECT</i><span> y </span><i>GROUP BY</i><span> de las sentencias SQL.</span><b></b></li><li><b>Indicadores. </b><span>Son las m&#233;tricas que se analizan en los informes. Indicadores habituales son “Ventas”, “Compras”, “N&#250;mero de empleados”, etc.  Se trata de informaci&#243;n num&#233;rica, y se suele incluir en las cl&#225;usulas </span><i>SELECT</i><span> con alguna funci&#243;n de agregaci&#243;n (</span><i>sum</i><span>, </span><i>avg</i><span>, </span><i>min</i><span>, </span><i>max</i><span>,...). </span><b></b></li><li><b>Filtros. </b><span>Son restricciones que pueden incluir los usuarios para limitar la informaci&#243;n que quieren consultar. Filtros habituales pueden ser “A&#241;o en curso”, “Clientes nacionales”, etc. Se incluyen en las cl&#225;usulas </span><i>WHERE</i><span> y </span><i>HAVING</i><span> de las sentencias SQL. </span><b></b></li></ul><p>La manera m&#225;s r&#225;pida y c&#243;moda de crear el cat&#225;logo es arrastrando los campos o tablas del “diagrama de tablas” hasta el “panel de navegaci&#243;n de objetos”.  </p><ul><li>Al arrastrar un campo, Bingo Intelligence crea autom&#225;ticamente una dimensi&#243;n. </li><li>Al arrastrar una tabla, Bingo Intelligence crea una carpeta y crea una dimensi&#243;n para cada campo de la tabla. </li></ul><p>Posteriormente podremos a&#241;adir, modificar o eliminar los elementos seg&#250;n las necesidades. Por ejemplo, al arrastrar la tabla de “Tiendas”, Bingo crear&#225; estos elementos:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/drag-drop-tablas.png" alt="Se pueden crear las dimensiones arrastrando desde el diagrama de tablas." title="Se pueden crear las dimensiones arrastrando desde el diagrama de tablas." width="538" height="307" /></p><p><span>Una vez creados, podemos modificarlos f&#225;cilmente. Desde el </span><b>men&#250; contextual</b><span> (bot&#243;n derecho) de cada elemento podemos abrir el formulario de “Propiedades”:</span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/propiedades-objeto.png" alt="Desde esta ventana, se puede renombrar un objeto o cambiar su definición SQL" title="Desde esta ventana, se puede renombrar un objeto o cambiar su definición SQL" width="390" height="333" /></p><p><span>Desde esta ventana podemos modificar el nombre de la dimensi&#243;n, y su definici&#243;n SQL. De esta manera, renombraremos el elemento “</span><i>Fec apertura</i><span>” llam&#225;ndole “</span><i>Fecha de apertura</i><span>”, a la dimensi&#243;n “</span><i>Responsable</i><span>” la llamaremos “</span><i>Responsable comercial</i><span>”, y pondremos los acentos en las palabras “</span><i>Pa&#237;s</i><span>” y “</span><i>Poblaci&#243;n</i><span>”. </span><b>Tambi&#233;n se puede renombrar un objeto pulsando F2, o con un doble clic lento del rat&#243;n.</b><span></span></p><p>En el men&#250; contextual tambi&#233;n tenemos la opci&#243;n de eliminar un objeto. En este caso, eliminaremos “Id Tienda”, que es un c&#243;digo interno irrelevante para los usuarios.</p><p>Una vez aplicadas es modificaciones, la carpeta “Tiendas” tendr&#225; este aspecto:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/carpeta-tiendas.png" alt="Vista de la carpeta tiendas después de hacer algunas modificaciones." title="Vista de la carpeta tiendas después de hacer algunas modificaciones." width="185" height="120" /></p><p>De este modo se puede crear el cat&#225;logo, arrastrando sucesivamente todas las tablas, renombrando o eliminando los objetos cuando se necesario, y ajustando la definici&#243;n SQL si hace falta. Si creamos una carpeta para cada tabla el cat&#225;logo resultante tendr&#225; este aspecto:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/objetos-catalogo-bruto.png" alt="Objetos del catálogo antes de organizarlos correctamente." title="Objetos del catálogo antes de organizarlos correctamente." width="186" height="467" /></p><p>En esta imagen superior aparecen tres tipos de iconos diferentes, que identifican cada tipo de objeto:</p><ul><li>Las “bolas azules” son dimensiones.</li><li><span>Las “bolas rojas” son indicadores. Para crear estos indicadores se ha seleccionado la opci&#243;n “</span><i><b>Convertir en indicador</b></i><span>” del men&#250; contextual (bot&#243;n derecho).</span></li><li>El “embudo amarillo” es un filtro. En este caso, se ha creado el filtro “A&#241;o actual” defini&#233;ndolo manualmente de esta manera:</li></ul><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/propiedades-objeto-filtro.png" alt="Definición del filtro &quot;Año actual&quot;" title="Definición del filtro &quot;Año actual&quot;" width="498" height="268" /></p><p>En este cat&#225;logo tambi&#233;n hemos eliminado todas las claves for&#225;neas y las claves primarias. Habitualmente, estas claves no tienen un significado de negocio, por lo que no es necesario que los usuarios tengan acceso a ellas. &#218;nicamente se han dejado las dimensiones e indicadores que pueden ser relevantes para los usuarios. Posteriormente, si es necesario, siempre podremos a&#241;adirlas al cat&#225;logo. </p><p>En este momento, el cat&#225;logo ya es funcional, y ya se podr&#237;a crear una aplicaci&#243;n, o hacer algunas pruebas sobre el correcto funcionamiento del sistema. Sin embargo, conviene organizar mejor las dimensiones, indicadores y filtros del cat&#225;logo.</p><h3>Organizar en carpetas las dimensiones, indicadores y filtros</h3><p><span>Para construir los informes, los usuarios podr&#225;n escoger las dimensiones, indicadores y filtros que quieren incluir, y </span><b>Bingo Intelligence generar&#225; la consulta o consultas necesarias para mostrar el resultado correcto.</b></p><p><span>En el cat&#225;logo debemos organizar las carpetas teniendo en cuenta las necesidades de los usuarios de negocio y buscando la facilidad de uso para ellos. El modelo de datos del sistema y la estructura de las tablas debe ser irrelevante para los usuarios. </span><b>Se deben organizar las dimensiones e indicadores de tal manera que sea sencillo encontrar la informaci&#243;n.</b><span>  </span></p><p><b>Los objetos se pueden organizar f&#225;cilmente arrastr&#225;ndolos con el rat&#243;n (drag&amp;drop).</b><span> Si se quiere poner una dimensi&#243;n como hija de otra, se tiene que arrastrar manteniendo la tecla </span><b>Ctrl</b><span> pulsada.</span></p><p>Tambi&#233;n podemos crear o eliminar las carpetas seg&#250;n las necesidades. Estas opciones est&#225;n en el men&#250; contextual (bot&#243;n derecho).</p><p><span>Tambi&#233;n se tiene que emplear la terminolog&#237;a habitual de los usuarios. Y se deben evitar nomenclaturas demasiado gen&#233;ricas como “Nombre”, “Tipo” o “Unidades”. El uso de estos t&#233;rminos puede generar confusi&#243;n posteriormente. </span><b>Es muy importante establecer el nombre m&#225;s apropiado para cada dimensi&#243;n e indicador.</b><span></span></p><p>Teniendo en cuenta estas consideraciones, podemos modificar el cat&#225;logo organiz&#225;ndolo de esta manera:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/objetos-catalogo-neto.png" alt="Objetos del catálogo después de organizarlos correctamente." title="Objetos del catálogo después de organizarlos correctamente." width="136" height="387" /></p><p><span>En este momento se deben hacer pruebas para verificar que el cat&#225;logo funciona, y que </span><a href="http://help.bingointelligence.com/articulo.html?id=43">Bingo Intelligence genera correctamente las sentencias SQL</a><span>. </span></p><h3>Verificaci&#243;n del funcionamiento del nuevo cat&#225;logo</h3><p><span>Para verificar que el cat&#225;logo se ha configurado correctamente, se puede </span><a href="http://help.bingointelligence.com/articulo.html?id=2">crear una nueva aplicaci&#243;n</a><span> utilizando el cat&#225;logo reci&#233;n creado, o se puede utilizar la </span><a href="http://help.bingointelligence.com/articulo.html?id=43">herramienta de cat&#225;logo para probar consultas</a><span>.</span></p><p>En este caso, utilizaremos el “Probador de consultas”. Para ello, seleccionaremos la opci&#243;n “Probar consulta sobre este cat&#225;logo” del men&#250; “Herramientas”, y definiremos esta consulta:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/consulta-sencilla-probador-consultas.png" alt="Las ventas del año anual por categorías." title="Las ventas del año anual por categorías." width="352" height="489" /></p><p>Pulsando el bot&#243;n “SQL” veremos la sentencia SQL generada:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/sentencia-sql-primeros-pasos.png" alt="SELECT
   LB_CATEGORIAS.CATEGORIA AS Categoria,
   sum(LB_VENTAS.UNIDADES) AS UnidadesVendidas
FROM LB_VENTAS
INNER JOIN LB_TIEMPO ON (LB_VENTAS.FECHA=LB_TIEMPO.FECHA)
INNER JOIN LB_LIBROS ON (LB_VENTAS.ID_LIBRO=LB_LIBROS.ID_LIBRO)
INNER JOIN LB_CATEGORIAS ON (LB_LIBROS.ID_CATEGORIA=LB_CATEGORIAS.ID_CATEGORIA)
WHERE
   LB_TIEMPO.ANYO=year(getdate())
GROUP BY
   LB_CATEGORIAS.CATEGORIA" title="SELECT
   LB_CATEGORIAS.CATEGORIA AS Categoria,
   sum(LB_VENTAS.UNIDADES) AS UnidadesVendidas
FROM LB_VENTAS
INNER JOIN LB_TIEMPO ON (LB_VENTAS.FECHA=LB_TIEMPO.FECHA)
INNER JOIN LB_LIBROS ON (LB_VENTAS.ID_LIBRO=LB_LIBROS.ID_LIBRO)
INNER JOIN LB_CATEGORIAS ON (LB_LIBROS.ID_CATEGORIA=LB_CATEGORIAS.ID_CATEGORIA)
WHERE
   LB_TIEMPO.ANYO=year(getdate())
GROUP BY
   LB_CATEGORIAS.CATEGORIA" width="504" height="151" /></p><p>Se observa que la sentencia es correcta, que incluye todas las tablas necesarias, y que devuelve las ventas del a&#241;o actual por categor&#237;as.</p><h3>Siguientes pasos</h3><p><span>En este art&#237;culo se han descrito los </span><b>primeros pasos</b><span> con el dise&#241;ador de cat&#225;logos, y se ha mostrado como construir un sencillo cat&#225;logo, con una sola tabla de hecho, y con unas pocas dimensiones e indicadores. El dise&#241;ador de cat&#225;logos de Bingo Intelligence incluye muchas caracter&#237;sticas adicionales para cubrir la mayor&#237;a de necesidades:</span></p><ul><li>Tablas agregadas</li><li>M&#250;ltiples tablas de hecho</li><li>Organizaci&#243;n del diagrama por pesta&#241;a</li><li>Indicadores avanzados (year-to-date, month-to-date, saldos, acumulados...)</li><li>Filtros din&#225;micos</li><li>Data-profiling</li><li>Listas de valores</li><li>Ordenaciones personalizadas</li><li>Tablas derivadas</li><li>Tablas adicionales (para poder implementar la “seguridad horizontal” y limitar la informaci&#243;n a la que tiene acceso cada usuario)</li><li>Detecci&#243;n de cambios en la estructura de la base de datos</li><li>Verificaci&#243;n de la integridad de los datos y la correcci&#243;n de las relaciones</li></ul><p>En resto de apartados de este manual, se introducen y explican con mayor detalle estas funcionalidades.</p></div></div></div>]]></description><pubDate>Mon, 06 Sep 2010 00:22:06 +0100</pubDate><guid isPermaLink="true">http://localhost/</guid></item><item><title>Cómo crear una conexión a la base de datos</title><link>http://localhost/</link><description><![CDATA[<div style="width:700px"><div class="contenido"><div><h3>Administraci&#243;n de tecnolog&#237;as</h3><p>En el momento de crear un cat&#225;logo de Bingo Intelligence debemos indicar el servidor donde se acceder&#225; para obtener los datos. T&#237;picamente, la conexi&#243;n al servidor queda definida mediante el nombre del servidor (o IP), el nombre de la base de datos, y unas credenciales (usuario y password).</p><p><span>Las conexiones a las bases de datos se crean y administran desde el “</span><b>Administrador de tecnolog&#237;as</b><span>”. </span></p><p><span>Para abrir esta ventana, se debe ir al men&#250; “</span><i>Herramientas</i><span>”, y seleccionar la opci&#243;n “</span><i>Bases de datos/Administrador de tecnolog&#237;as</i><span>”.</span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/administrador-tecnologias.png" alt="Administrador de tecnologías" title="Administrador de tecnologías" width="301" height="339" /></p><p>En esta ventana las conexiones a los distintos servidores est&#225;n agrupadas seg&#250;n los distintos gestores de bases de datos (o tecnolog&#237;as).</p><p>A trav&#233;s del men&#250; contextual (bot&#243;n derecho del rat&#243;n), podemos modificar las conexiones existentes o crear nuevas.</p><h3>Propiedades de conexi&#243;n</h3><p><span>Al abrir las propiedades de un servidor, aparece un formulario desde donde se pueden definir los </span><b>par&#225;metros de conexi&#243;n</b><span>:</span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/propiedades-servidor.png" alt="Desde la ventana de propiedades del servidor es posible establecer los parámetros de conexión." title="Desde la ventana de propiedades del servidor es posible establecer los parámetros de conexión." width="299" height="443" /></p><p>Los par&#225;metros que se pueden configurar son:</p><ul><li><b>Nombre de la conexi&#243;n: </b><span>Es un nombre meramente informativo. Si se deja el “check” marcado, se le asigna un nombre autom&#225;ticamente.</span><b></b></li><li><b>Servidor: </b><span>Es el nombre del servidor (o su IP). </span><b> </b><span>El servidor de base de datos debe ser accesible desde el servidor Bingo. No es necesario (ni conveniente) que los equipos de los usuarios tengan acceso directo a dicho servidor.</span><b></b></li><li><b>Base de datos: </b><span>Es el nombre de la base de datos (o cat&#225;logo). </span><b></b></li><li><b>Esquema: </b><span>Es el esquema predeterminado de la base de datos. Si las tablas pertenecen a este esquema, Bingo emplear&#225; la nomenclatura  abreviada de tablas y campos (sin especificar expl&#237;citamente el “esquema”).</span><b></b></li><li><b>Tipo de autentificaci&#243;n:</b><span> En funci&#243;n de la configuraci&#243;n del gestor de la base de datos, se pueden utilizar las credenciales de Windows o utilizar el m&#233;todo de autentificaci&#243;n propio de cada base de datos. Si se utiliza la autentificaci&#243;n Windows, se emplear&#225;n las credenciales de la cuenta de sistema ASP.NET del servidor Bingo.</span><b></b></li><li><b>Usuario y password: </b><span>Son las credenciales que se utilizar&#225;n para establecer la conexi&#243;n (en el caso de que no se emplee autentificaci&#243;n Windows).</span><b></b></li></ul><p>Haciendo clic en el bot&#243;n “Test” verificaremos si los par&#225;metros de conexi&#243;n son correctos. Si el servidor Bingo es capaz de establecer la conexi&#243;n con el servidor de datos debe aparecer el siguiente mensaje:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/conexion-datos-ok.png" alt="La conexión se ha establecido correctamente." title="La conexión se ha establecido correctamente." width="296" height="142" /></p><p><span>Desde la pesta&#241;a “</span><i>Configuraci&#243;n avanzada</i><span>” podemos ver la </span><b>cadena de conexi&#243;n</b><span> definida.</span></p><h3>Tecnolog&#237;as soportadas</h3><p>De manera predeterminada, Bingo Intelligence est&#225; preparado para conectarse a los gestores de bases de datos m&#225;s habituales (SQL Server, Oracle, MySQL, etc.). Sin embargo, Bingo Intelligence puede conectarse a pr&#225;cticamente cualquier base de datos relacional.</p><p><span>Consulte con su comercial o solicite m&#225;s informaci&#243;n sobre sus necesidades particulares en </span><a href="mailto:info@bingointelligence.com">info@bingointelligence.com</a><span>.</span></p></div></div></div>]]></description><pubDate>Mon, 06 Sep 2010 00:21:23 +0100</pubDate><guid isPermaLink="true">http://localhost/</guid></item><item><title>Proceso de actualización</title><link>http://localhost/</link><description><![CDATA[<div style="width:700px"><div class="contenido"><div><h3>Administrador de Bingo Intelligence</h3><p><span>El “Administrador de Bingo Intelligence” es la aplicaci&#243;n que utiliza el administrador del sistema para instalar, configurar y actualizar la plataforma. Adem&#225;s, de </span><a href="http://help.bingointelligence.com/articulo.html?id=32">instalar el servidor de Bingo Intelligence</a><span>, con el Administrador se pueden aplicar las actualizaciones cuando est&#225;n disponibles.</span></p><p>Una vez instalada la plataforma, el Administrador debe mostrar este diagrama:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/actualizar-bingo1.png" alt="Administrador de Bingo Intelligence mostrando una instalación actualizada." title="Administrador de Bingo Intelligence mostrando una instalación actualizada." width="468" height="309" /></p><p>En este diagrama se indica:</p><ul><li>La &#250;ltima versi&#243;n disponible de la plataforma de Bingo Intelligence</li><li>La versi&#243;n seleccionada desde el Administrador</li><li>La versi&#243;n instalada en el servidor</li><li>Y la conformidad de la estructura del repositorio con la versi&#243;n del servidor</li></ul><p><b>Cuando todas estas versiones coinciden, la instalaci&#243;n est&#225; actualizada.</b></p><h3>Actualizaciones peri&#243;dicas</h3><p>Peri&#243;dicamente, Bingo Intelligence pone a disposici&#243;n de sus clientes nuevas versiones que resuelven problemas conocidos o que a&#241;aden nuevas funcionalidades.</p><p><span>Para poder disfrutar de estas mejoras, </span><b>se recomienda mantener siempre la instalaci&#243;n actualizada con las &#250;ltimas versiones disponibles.</b></p><p><span>Bingo Intelligence nunca actualiza la instalaci&#243;n de los clientes ni de los servidores autom&#225;ticamente. </span><b>Debe ser el administrador quien actualice el sistema</b><span> desde el “Administrador de Bingo Intelligence”.</span></p><p>El proceso es sencillo. Adem&#225;s, al actualizar el servidor, se sincronizar&#225; tambi&#233;n la versi&#243;n de todos los clientes de Bingo An&#225;lisis y Bingo Excel (la siguiente vez que se conecten).</p><p>Cuando existe una nueva versi&#243;n disponible, &#233;sta aparece en el diagrama del Administrador, y aparece un mensaje advirtiendo que la instalaci&#243;n no est&#225; actualizada:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/actualizar-bingo2.png" alt="Administrador de Bingo Intelligence mostrando una instalación NO actualizada." title="Administrador de Bingo Intelligence mostrando una instalación NO actualizada." width="489" height="323" /></p><p><span>Para actualizar el sistema se debe hacer clic en el bot&#243;n “</span><b>Actualizar ahora</b><span>”, y aparecer&#225; el siguiente asistente:</span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/actualizar-bingo3.png" alt="Asistente de actualización" title="Asistente de actualización" width="486" height="311" /></p><p><span>El asistente de actualizaci&#243;n es muy parecido al </span><a href="http://help.bingointelligence.com/articulo.html?id=32">asistente de instalaci&#243;n</a><span>, y se pueden dejar las opciones predeterminadas. Al finalizar debe aparecer este mensaje:</span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/actualizar-bingo4.png" alt="La actualización ha finalizado correctamente." title="La actualización ha finalizado correctamente." width="497" height="318" /></p><p><span>Adem&#225;s el “</span><b>Administrador de Bingo Intelligence</b><span>” mostrar&#225; que se ha actualizado la versi&#243;n del servidor, y que la instalaci&#243;n ya es correcta:</span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/actualizar-bingo5.png" alt="Administrador de Bingo Intelligence mostrando una instalación actualizada." title="Administrador de Bingo Intelligence mostrando una instalación actualizada." width="502" height="332" /></p><p>Durante el proceso de actualizaci&#243;n, se sobrescriben los ficheros del servicio web de Bingo Intelligence y, si es necesario, se actualiza la estructura del repositorio. </p><p><b>IMPORTANTE:</b><span> El repositorio contiene toda la configuraci&#243;n de la plataforma Bingo Intelligence, incluyendo toda la configuraci&#243;n de usuarios, todos los cat&#225;logos, y todas las aplicaciones e informes de los usuarios. Para migrar el sistema a otro servidor, o para recuperar la instalaci&#243;n despu&#233;s de un “desastre”, s&#243;lo es necesario disponer de una copia actualizada de esta base de datos. </span><b>El administrador del sistema es responsable de hacer copias de seguridad de esta base de datos de manera peri&#243;dica, y de establecer los mecanismos de recuperaci&#243;n oportunos. </b><span></span></p><h3>Resoluci&#243;n de incidencias</h3><p><span>Una vez instalada la plataforma no es necesario ning&#250;n mantenimiento especial. Sin embargo, ocasionalmente, puede ser necesario modificar la configuraci&#243;n existente. Esto puede ocurrir, por ejemplo, si se desea cambiar la ubicaci&#243;n del servicio web, o si se desea cambiar la configuraci&#243;n de conexi&#243;n al repositorio. Tambi&#233;n existe la opci&#243;n de realizar un “</span><i>downgrade</i><span>” a una versi&#243;n previa de Bingo Intelligence.</span></p><p>Para acceder a estas opciones de configuraci&#243;n, se debe hacer clic en los elementos que aparecen en el diagrama.</p><h4>Configuraci&#243;n del Repositorio</h4><p>Al hacer clic en el icono del “Repositorio de Bingo Intelligence” aparece esta ventana de configuraci&#243;n:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/actualizar-bingo6.png" alt="Configuración de la conexión al repositorio." title="Configuración de la conexión al repositorio." width="375" height="328" /></p><p>Desde aqu&#237; se puede modificar la cadena de conexi&#243;n almacenada en Web.config, o verificar si la estructura de la base de datos es correcta.</p><h4>Configuraci&#243;n del Servidor</h4><p>Al hacer clic en el icono del “Servidor de Bingo Intelligence” aparece esta ventana de configuraci&#243;n:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/actualizar-bingo7.png" alt="Configuración del Servicio de Bingo Intelligence" title="Configuración del Servicio de Bingo Intelligence" width="490" height="321" /></p><p>Desde aqu&#237; se puede reinstalar el servicio o modificar su ubicaci&#243;n. Si se cambia la URL, los clientes deber&#225;n instalarse de nuevo Bingo An&#225;lisis y Bingo Excel desde la nueva ubicaci&#243;n.</p><p><span>Tambi&#233;n se puede </span><a href="http://help.bingointelligence.com/articulo.html?id=35">definir el modo de autentificaci&#243;n de los usuarios</a><span>.</span></p><h4>Cliente de administraci&#243;n</h4><p>Al hacer clic en el icono del “Cliente de administraci&#243;n Bingo” aparece esta ventana de configuraci&#243;n:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/actualizar-bingo8.png" alt="Configuración del cliente de configuración de servidores." title="Configuración del cliente de configuración de servidores." width="470" height="257" /></p><p><span>Desde esta ventana se puede seleccionar la versi&#243;n que se instalar&#225; en el servidor y en todos los clientes. </span><b>Se recomienda instalar siempre la &#250;ltima versi&#243;n disponible.</b><span></span></p><h3>Actualizaci&#243;n del Administrador de Bingo Intelligence</h3><p><span>Excepcionalmente, Bingo Intelligence puede actualizar el propio “Administrador de Bingo Intelligence”. En este caso, es necesario descargarse e instalar la nueva versi&#243;n de </span><span style="text-decoration: underline;"><b>BingoAdminSetup.msi</b></span><span>. </span></p><p>Si hay una actualizaci&#243;n del Administrador Bingo Intelligence, aparecer&#225; un icono de advertencia en el diagrama:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/actualizar-bingo9.png" alt="Nueva versión del Administrador de Bingo Intelligence disponible." title="Nueva versión del Administrador de Bingo Intelligence disponible." width="515" height="401" /></p><p>Al hacer clic en el icono se abrir&#225; un formulario desde donde podremos descargarla.</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/actualizar-bingo10.png" alt="Nueva versión del Administrador de Bingo Intelligence disponible." title="Nueva versión del Administrador de Bingo Intelligence disponible." width="454" height="241" /></p><p>Una vez descargada se debe cerrar el administrador, ejecutar el programa de instalaci&#243;n, y seguir los pasos indicados en pantalla.</p><p><b>Se recomienda instalar siempre la &#250;ltima versi&#243;n disponible del Administrador de Bingo Intelligence.</b></p></div></div></div>]]></description><pubDate>Mon, 06 Sep 2010 00:18:37 +0100</pubDate><guid isPermaLink="true">http://localhost/</guid></item><item><title>Proceso de instalación</title><link>http://localhost/</link><description><![CDATA[<div style="width:700px"><div class="contenido"><div><h3>V&#237;deo sobre c&#243;mo instalar el servidor de Bingo Intelligence</h3><p>El siguiente v&#237;deo muestra el proceso completo de instalaci&#243;n de Bingo Intelligence.</p><img src="http://help.bingointelligence.com/images/youtube.jpg" alt="Elemento multimedia" title="Elemento multimedia" style="display:block;text-align:center;margin-left:auto;margin-right:auto;" /><p></p><p><b>ADVERTENCIA: </b><span>El v&#237;deo corresponde a una versi&#243;n de Bingo Intelligence de marzo del 2010. Pueden existir peque&#241;as diferencias entre lo mostrado en el v&#237;deo y el proceso real de instalaci&#243;n.</span></p><p>A continuaci&#243;n se explica con detalle todo el proceso de instalaci&#243;n</p><h3>Conceptos previos</h3><p>La plataforma Bingo Intelligence est&#225; formada por los siguientes componentes:</p><ul><li>Bingo An&#225;lisis (que incluye Bingo Planning)</li><li>Bingo Excel</li><li>Servidor Bingo</li><li>Repositorio Bingo</li><li>Administrador de Bingo Intelligence</li></ul><p><span>Antes de empezar, conviene estar familiarizado con la funci&#243;n de cada componente dentro de la plataforma. Para ello, se puede consultar el art&#237;culo de ayuda llamado </span><a href="http://help.bingointelligence.com/articulo.html?id=30">“&#191;Qu&#233; es Bingo Intelligence?”</a><span>.</span></p><p>En los siguientes apartados se describen, en este orden, los pasos necesarios para instalar la plataforma completa:</p><ul><li>Preparaci&#243;n previa</li><li>Instalar el Administrador de Bingo Intelligence</li><li>Instalar el servidor Bingo</li><li>Crear el repositorio Bingo</li><li>Verificar las comunicaciones y la correcta instalaci&#243;n de:</li><li>Bingo An&#225;lisis</li><li>Bingo Excel</li></ul><p>La instalaci&#243;n es sencilla y puede realizarse en pocos minutos. De todos modos, es necesario disponer de unos conocimientos m&#237;nimos de administraci&#243;n de un servidor Windows (y de una base de datos de SQL Server).</p><h3>Preparaci&#243;n previa</h3><p><span>Antes de instalar la plataforma de Bingo Intelligence es necesario asegurarse que el servidor donde se instalar&#225; cumple los </span><a href="http://help.bingointelligence.com/articulo.html?id=31">requerimientos m&#237;nimos</a><span>. En concreto, conviene verificar que:</span></p><ul><li><span>Que el </span><b>servidor IIS</b><span> est&#225; instalado y funcionando, para ello suele ser suficiente verificar que el servidor sirve una p&#225;gina al acceder a </span><a>http://localhost</a><span></span></li><li><span>Que el </span><b>.NET Framework 4</b><span> de Microsoft est&#225; instalado. Esto puede comprobarse desde el “Panel de control”, en el apartado “Instalar o desinstalar programas”.</span></li><li><span>Que la base de datos </span><b>SQL Server </b><span>donde se crear&#225; el repositorio de Bingo Intelligence est&#225; activa y accesible. Para ello, se debe abrir el “SQL Server Management Studio” y establecer una conexi&#243;n con dicho servidor.</span></li></ul><p>Evidentemente, se recomienda que el servidor est&#233; “limpio”, con suficiente espacio en disco para el buen funcionamiento de Windows, y con el menor n&#250;mero de aplicaciones y/o servicios instalados. </p><p>Bingo Intelligence puede compartir servidor con otras aplicaciones aunque, evidentemente, el rendimiento siempre ser&#225; mejor si se dispone de un servidor dedicado.</p><p>Por razones de seguridad, tambi&#233;n se recomienda ejecutar “Windows Update” hasta que el sistema indique que “No hay m&#225;s actualizaciones disponibles”.</p><h3>Instalaci&#243;n del Administrador de Bingo Intelligence</h3><p>Para empezar la instalaci&#243;n se debe instalar el “Administrador de Bingo Intelligence”</p><p><span>El “Administrador de Bingo Intelligence” es la aplicaci&#243;n que utiliza el administrador del sistema para instalar, configurar y actualizar el resto de la plataforma. Con esta aplicaci&#243;n, se instala el servidor, se crea el repositorio y se publican los links de instalaci&#243;n de&#160;</span><i>Bingo An&#225;lisis</i><span> y&#160;</span><i>Bingo Excel</i><span>.</span></p><p>Tambi&#233;n se utiliza este administrador para configurar el tipo de autentificaci&#243;n y para instalar nuevas versiones de la plataforma de Bingo Intelligence cuando est&#225;n disponibles.</p><p>En general, se recomienda instalar el Administrador en el mismo ordenador donde se instalar&#225; el servidor de Bingo.</p><p>Para proceder a la instalaci&#243;n hacen falta dos cosas:</p><ul><li><b>El programa de setup</b><span> (que es un fichero llamado </span><i>BingoAdminSetup.msi</i><span>).</span></li><li><b>El n&#250;mero de licencia</b><span> (con el formato </span><i>XXXX-XXXX-XXXX</i><span>).</span></li></ul><p>El “setup” habitualmente lo entrega el comercial de Bingo Intelligence al cliente que quiere instalar o probar el producto. Junto al setup se proporciona el n&#250;mero de licencia que permite la instalaci&#243;n a dicha empresa.</p><p>Al ejecutar el setup, se iniciar&#225; el “Asistente de instalaci&#243;n” del “Administrador de Bingo Intelligence”:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/asistente-instalacion-admin1.png" alt="Pantala inicial del asistente para la instalación del Administrador de Bingo Intelligence" title="Pantala inicial del asistente para la instalación del Administrador de Bingo Intelligence" width="356" height="291" /></p><p>Al pulsar el bot&#243;n “Siguiente”, aparece una pantalla donde se puede elegir la ubicaci&#243;n donde se instalar&#225; la aplicaci&#243;n:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/asistente-instalacion-admin2.png" alt="Asistente para la instalación del Administrador de Bingo Intelligence" title="Asistente para la instalación del Administrador de Bingo Intelligence" width="363" height="297" /></p><p>Al pulsar “Siguiente”, se inicia el proceso de instalaci&#243;n, y a los pocos segundos debe aparecer un mensaje informando que la instalaci&#243;n ha finalizado correctamente:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/asistente-instalacion-admin3.png" alt="Asistente para la instalación del Administrador de Bingo Intelligence" title="Asistente para la instalación del Administrador de Bingo Intelligence" width="379" height="310" /></p><p>Una vez instalado, ya se puede ejecutar el programa “Administrador de Bingo Intelligence”. La aplicaci&#243;n se encontrar&#225; en “Inicio/Todos los programas/Bingo Intelligence”.</p><p>Al iniciar el administrador por primera vez se solicita el n&#250;mero de licencia. Deberemos escribir el “n&#250;mero de licencia” y hacer clic en el bot&#243;n “Aceptar”.</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/dialogo-numero-licencia.png" alt="Verificación del número de licencia" title="Verificación del número de licencia" width="294" height="272" /></p><p>Una vez validado el n&#250;mero de licencia, se abrir&#225; el Administrador. El Administrador es una aplicaci&#243;n muy sencilla que muestra un diagrama con el estado actual de la instalaci&#243;n. Inicialmente, el diagrama tendr&#225; esta apariencia:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/admin-bingo-intelligence.png" alt="Diagrama del &quot;Administrador de Bingo Intelligence&quot;" title="Diagrama del &quot;Administrador de Bingo Intelligence&quot;" width="441" height="291" /></p><p>Este diagrama indica cu&#225;l es la versi&#243;n m&#225;s actual disponible (en azul, a la izquierda), cu&#225;l es la versi&#243;n que tenemos instalada en nuestra organizaci&#243;n, y cu&#225;l es el estado del servicio y del repositorio. De entrada no tenemos nada instalado, por lo que debemos hacer clic en “Instalar ahora” para proceder a la instalaci&#243;n.</p><h3>Instalaci&#243;n del servidor de Bingo Intelligence</h3><p>Al hacer clic en “Instalar ahora”, se abre el “Asistente de instalaci&#243;n del servidor”:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/asistente-instalacion-bi0.png" alt="Asistente para la instalación del servidor" title="Asistente para la instalación del servidor" width="454" height="290" /></p><p>En el primer paso del asistente se debe indicar la carpeta f&#237;sica donde se copiar&#225; el “servicio web”. Tambi&#233;n se debe indicar la URL que utilizar&#225;n los usuarios para acceder a la plataforma. Esta URL se puede cambiar posteriormente.</p><p><span>En esta ubicaci&#243;n tambi&#233;n se publicar&#225;n los links a los programas de instalaci&#243;n de </span><i>Bingo An&#225;lisis</i><span> y </span><i>Bingo Excel</i><span> que utilizar&#225;n los usuarios. </span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/asistente-instalacion-bi1.png" alt="Asistente para la instalación del servidor" title="Asistente para la instalación del servidor" width="458" height="293" /></p><p>Al hacer clic en “Siguiente”, se copian todos los archivos en la ubicaci&#243;n seleccionada, y aparece una pantalla donde se puede verificar si la aplicaci&#243;n est&#225; accesible y si el servidor IIS est&#225; correctamente configurado.</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/asistente-instalacion-bi2.png" alt="Asistente para la instalación del servidor" title="Asistente para la instalación del servidor" width="455" height="291" /></p><p><span>Inicialmente, aparecer&#225; un mensaje de error al verificar el acceso al servicio web. Es normal. </span><b>Se debe configurar el servidor IIS.</b><span> Los pasos concretos para configurar el IIS pueden variar ligeramente en funci&#243;n del sistema operativo y de la versi&#243;n de IIS que se est&#233; utilizando. En cualquier caso, se deben aplicar las siguientes configuraciones:</span></p><ul><li><span>Se tiene que convertir la carpeta “bingo” donde se han copiado los archivos en una “</span><b>Aplicaci&#243;n IIS</b><span>”.</span></li><li><span>Se tiene que definir que esta aplicaci&#243;n utiliza </span><b>ASP.NET v4</b><span> </span></li></ul><p>Una vez realizadas estas configuraciones, debe aparecer el siguiente mensaje al “verificar el acceso al servicio web”:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/conexion-ok1.png" alt="Asistente para la instalación del servidor" title="Asistente para la instalación del servidor" width="357" height="171" /></p><p>Ocasionalmente, las configuraciones anteriores no ser&#225;n suficientes, y obtendremos un mensaje de error. Este problema puede ocurrir en funci&#243;n del orden en que se haya instalado el IIS y el Framework .NET, o en el caso que otras aplicaciones hayan modificado la configuraci&#243;n predeterminada de Windows. Para solucionar la incidencia, debemos registrar de nuevo el ASP.NET y/o los componentes de WCF.</p><p>Para registrar ASP.NET, se debe ejecutar el siguiente comando:</p><p><i>C:\Windows\Microsoft.NET\Framework\v4.0.30319\aspnet_regiis.exe –i</i></p><p>Excepcionalmente, tambi&#233;n puede ser necesario reinstalar los componentes de WCF</p><p><i>C:\Windows\Microsoft.NET\Framework\v4.0.30319\ServiceModelReg.exe –ia</i></p><p><span>Si aun as&#237; no se consigue verificar la conexi&#243;n con el servicio web, puede obtenerse informaci&#243;n adicional en el art&#237;culo donde se explican los </span><a href="http://help.bingointelligence.com/articulo.html?id=47">problemas de instalaci&#243;n m&#225;s habituales</a><span>.</span></p><p>Al resolver todas las posibles incidencias debe aparecer, finalmente, el mensaje advirtiendo que est&#225; todo correcto:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/conexion-ok2.png" alt="Asistente para la instalación del servidor" title="Asistente para la instalación del servidor" width="357" height="171" /></p><p>Una vez instalado el servicio web, se puede proceder a instalar el repositorio. Para ello, se debe pulsar el bot&#243;n “Siguiente”.</p><h3>Instalaci&#243;n del repositorio</h3><p>Una vez instalado el servicio web, aparecer&#225; esta pantalla:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/asistente-instalacion-bi3.png" alt="Asistente para la instalación del servidor" title="Asistente para la instalación del servidor" width="455" height="291" /></p><p>En este formulario, se debe crear la conexi&#243;n con la base de datos donde residir&#225; el repositorio. Para ello, debemos indicar el nombre del servidor, el nombre de la base de datos, y el nombre y el password del usuario que se conectar&#225;.</p><p><b>La base de datos se tiene que crear manualmente desde el </b><i><b>SQL Server Management Studio</b></i><b>. </b><span>Tambi&#233;n se debe crear el usuario que se conectar&#225; y &#233;ste debe tener permisos de propietario de la base de datos. Es suficiente crear la base de datos </span><span style="text-decoration: underline;">vac&#237;a</span><span> con las opciones predeterminadas de SQL Server, aunque tambi&#233;n se puede aplicar con cualquier otra configuraci&#243;n que se desee (indicando otra ubicaci&#243;n para los archivos de base de datos, o un modo de recuperaci&#243;n espec&#237;fico, por ejemplo)...</span></p><p>El servidor web ser&#225; el &#250;nico componente que se conectar&#225; al repositorio por lo que si la base de datos est&#225; en la misma m&#225;quina se puede referenciar como “localhost”, aunque se recomienda utilizar el nombre de la m&#225;quina.</p><p>El nombre de la base de datos que propone el “Asistente de instalaci&#243;n” es BI_REPO, aunque se puede indicar cualquier otro nombre que se desee.</p><p>Por defecto, el asistente solicita un nombre y un password, aunque tambi&#233;n se puede configurar manualmente la conexi&#243;n para que utilice la autentificaci&#243;n integrada de Windows. En este caso, el usuario que se conectar&#225; es el que ejecuta ASP.NET, por lo que deberemos establecer los permisos necesarios.</p><p><span>Una vez indicados los par&#225;metros de conexi&#243;n, se debe pulsar el bot&#243;n “Guardar cambios” y esta configuraci&#243;n quedar&#225; guardada en el fichero de configuraci&#243;n del servicio web (</span><i>Web.config</i><span>).</span></p><p>Al pulsar el bot&#243;n “Siguiente” se verificar&#225; la conexi&#243;n. Si no es posible conectar, aparecer&#225; un mensaje indicando cual es problema. Si la conexi&#243;n es correcta, aparecer&#225; la siguiente  pantalla al cabo de pocos segundos:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/asistente-instalacion-bi4.png" alt="Asistente para la instalación del servidor" title="Asistente para la instalación del servidor" width="491" height="314" /></p><p>Este formulario muestra el script SQL que se ejecutar&#225; para crear el repositorio. No es necesario hacer nada; simplemente, se debe hacer clic en el bot&#243;n “Siguiente”, y el sistema proceder&#225; a crear todas las tablas del repositorio de Bingo Intelligence.</p><p><b>IMPORTANTE: </b><span>Esta base de datos contendr&#225; toda la configuraci&#243;n de la plataforma Bingo Intelligence, incluyendo toda la configuraci&#243;n de usuarios, todos los cat&#225;logos, y todas las aplicaciones e informes de los usuarios. Para migrar el sistema a otro servidor, o para recuperar la instalaci&#243;n despu&#233;s de un “desastre”, s&#243;lo es necesario disponer de una copia actualizada de esta base de datos. </span><b>El administrador del sistema es responsable de hacer copias de seguridad de esta base de datos de manera peri&#243;dica, y de establecer los mecanismos de recuperaci&#243;n oportunos.</b></p><h3>Pasos finales del asistente de instalaci&#243;n</h3><p>Una vez creado el repositorio, aparecer&#225; la siguiente pantalla:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/asistente-instalacion-bi5.png" alt="Asistente para la instalación del servidor" title="Asistente para la instalación del servidor" width="501" height="321" /></p><p>En este formulario nos solicita permiso para crear una tarea programada. Esta tarea sirve para ejecutar los informes de Bingo Excel que programan los usuarios (desde Bingo Excel, los usuarios tienen la opci&#243;n de definir la periodicidad, y los destinatarios de los informes generados).</p><p>Inicialmente, la tarea programada est&#225; inactiva. En el caso de que se desee hacer uso de esta funcionalidad, se debe activar la tarea desde el administrador de tareas programadas de Windows. </p><p>Al hacer clic en el bot&#243;n “Siguiente”, aparecer&#225; un mensaje informando que la instalaci&#243;n ha terminado:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/asistente-instalacion-bi6.png" alt="Asistente para la instalación del servidor" title="Asistente para la instalación del servidor" width="501" height="321" /></p><p>Al cerrar el asistente, se actualizar&#225; el diagrama de la instalaci&#243;n, y debe tener esta apariencia:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/diagrama-instalacion-ok.png" alt="Diagrama de la instalación de Bingo Intelligence" title="Diagrama de la instalación de Bingo Intelligence" width="501" height="331" /></p><p><span>En este momento, la instalaci&#243;n del servidor ya est&#225; finalizada. Se ha instalado el servicio web y el repositorio de Bingo. Tambi&#233;n se han copiado los ficheros que utilizar&#225;n los usuarios para instalar los clientes de </span><i>Bingo An&#225;lisis</i><span> y </span><i>Bingo Excel</i><span>. </span></p><p><b>IMPORTANTE: </b><span>Inicialmente el repositorio de Bingo Intelligence no tiene ning&#250;n usuario creado. </span><b>El primer usuario que se conecte al servidor se crear&#225; autom&#225;ticamente como usuario administrador.</b><span> Por lo tanto, antes de compartir el enlace con otros usuarios o t&#233;cnicos, es importante que el administrador se conecte y verifique que la plataforma funciona correctamente. Posteriormente, se podr&#225;n crear m&#225;s usuarios, m&#225;s administradores, o cambiar los existentes.</span></p><h3>Verificaci&#243;n de la instalaci&#243;n</h3><p><span>Para verificar la instalaci&#243;n, se debe acceder a la </span><i>p&#225;gina de entrada</i><span> de la plataforma. </span><i>Bingo An&#225;lisis</i><span> y </span><i>Bingo Excel</i><span> utilizan la tecnolog&#237;a de implementaci&#243;n denominada </span><i>ClickOnce. </i><span>Con esta tecnolog&#237;a los usuarios pueden instalarse las aplicaciones de manera muy sencilla (con un solo clic).</span></p><p><span>Se pueden instalar los clientes de Bingo An&#225;lisis y Bingo Excel en el propio servidor. Para realizar la instalaci&#243;n de los clientes, </span><b>se debe utilizar el navegador Internet Explorer.</b><span> Lamentablemente, no es posible por el momento instalar aplicaciones ClickOnce desde Chrome o Firefox. </span></p><p><span>Si se han mantenido los par&#225;metros predeterminados, la ubicaci&#243;n de la </span><i>p&#225;gina de entrada</i><span> de la plataforma es: </span><a>http://localhost/bingo</a><span></span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/portal-bingo-intelligence.png" alt="Página de entrada a la plataforma de Bingo Intelligence" title="Página de entrada a la plataforma de Bingo Intelligence" width="445" height="364" /></p><p><span>Para instalar el cliente de Bingo An&#225;lisis, se debe hacer clic en el enlace de “</span><i>Bingo An&#225;lisis</i><span>”. Aparecer&#225; una advertencia de seguridad que informa que una aplicaci&#243;n de </span><i>Bingo Intelligence S.L.</i><span> est&#225; a punto de instalarse:</span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/advertencia-seguridad.png" alt="Advertencia de seguridad" title="Advertencia de seguridad" width="481" height="288" /></p><p><span>Al hacer clic en el bot&#243;n “Install”, se instalar&#225; </span><i>Bingo An&#225;lisis</i><span> y aparecer&#225; el siguiente di&#225;logo de conexi&#243;n:</span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/dialogo-conexion.png" alt="Formulario de autentificación del usuario" title="Formulario de autentificación del usuario" width="318" height="371" /></p><p>Para conectarse, se puede utilizar el usuario que actualmente haya iniciado sesi&#243;n en Windows, o se puede establecer las credenciales de otro usuario. El primer usuario que se conecte se crea autom&#225;ticamente con permisos de administraci&#243;n.</p><p><span>Una vez conectado, aparecer&#225; la aplicaci&#243;n </span><i>Bingo An&#225;lisis</i><span>, verific&#225;ndose de este modo que la instalaci&#243;n se ha efectuado correctamente.</span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/interfaz-bingo-analisis-inicial.png" alt="Pantalla inicial de Bingo Análisis" title="Pantalla inicial de Bingo Análisis" width="463" height="321" /></p><h3>Siguientes pasos</h3><p>Antes de compartir el enlace de instalaci&#243;n con el resto de t&#233;cnicos y usuarios conviene realizar algunas acciones adicionales:</p><ul><li>Instalar la aplicaci&#243;n de ejemplo</li><li>Dar de alta a los usuarios del sistema</li><li>Incluir el link de instalaci&#243;n en la intranet corporativa</li></ul><h4>Instalar la aplicaci&#243;n de ejemplo</h4><p><span>Inicialmente, el repositorio tiene un cat&#225;logo y una aplicaci&#243;n de ejemplo. Sin embargo, la base de datos de ejemplo no est&#225; instalada en el servidor. Por este motivo, es normal que aparezca un error al intentar abrir el informe predeterminado. Para poder navegar por la aplicaci&#243;n </span><i>LA BIBLIO</i><span>, es necesario instalar la base de datos </span><i>BI_BIBLIO</i><span>, y se deben definir los par&#225;metros de conexi&#243;n a esta base de datos de ejemplo. En el art&#237;culo sobre </span><a href="http://help.bingointelligence.com/articulo.html?id=41">c&#243;mo instalar la aplicaci&#243;n de ejemplo</a><span> se incluye informaci&#243;n m&#225;s detallada.</span></p><h4>Dar de alta a los usuarios del sistema</h4><p><span>El primer usuario que se conecta al servidor se crea como usuario administrador. &#201;ste es el &#250;nico usuario que se crea de manera autom&#225;tica. Para que puedan acceder otros usuarios, es necesario </span><a href="http://help.bingointelligence.com/articulo.html?id=34">dar de alta los usuarios y los grupos de usuarios que sea conveniente</a><span>.</span></p><h4>Incluir el link de instalaci&#243;n en la intranet corporativa</h4><p>Por defecto, los t&#233;cnicos y el resto de usuarios pueden instalar la aplicaci&#243;n en sus ordenadores siguiendo los links que muestra Bingo Intelligence en la p&#225;gina de entrada:</p><ul><li><a>http://MI-SERVIDOR/bingo/bingo.application</a><span> (Para instalar </span><b>Bingo An&#225;lisis</b><span>)</span></li><li><a>http://MI-SERVIDOR/bingo/Bingo.Excel2007.vsto</a><span> (Para instalar </span><b>Bingo Excel</b><span>)</span></li></ul><p>Esta pantalla puede modificarse o eliminarse completamente. Para que los usuarios puedan instal&#225;rselo, simplemente es necesario copiar estos enlaces en la intranet corporativa o en la p&#225;gina que la organizaci&#243;n considere oportuno.</p><p>Desde el administrador de IIS es posible modificar la URL del servidor. Por ejemplo, es posible configurar la plataforma para que sea accesible desde direcciones como &#233;stas:</p><ul><li><a href="http://bingo.mi-organizacion.com/">http://bingo.mi-organizacion.com</a><span></span></li><li><a href="http://intranet.mi-organizacion.com/bingom">http://intranet.mi-organizacion.com/bingo</a><span></span></li><li><a href="https://bingo.mi-organizacion.com/">https://bingo.mi-organizacion.com</a><span></span></li><li><a href="https://intranet.mi-organizacion.com/bingo">https://intranet.mi-organizacion.com/bingo</a><span></span></li></ul><p>La comunicaciones entre los clientes y el servidor se realizan utilizando los protocolos est&#225;ndar web (http/https). Por lo tanto, es  posible acceder a la aplicaci&#243;n indistintamente desde dentro de la oficina o desde una ubicaci&#243;n remota. Para ello, s&#243;lo es necesario configurar convenientemente las comunicaciones del servidor (firewalls, etc.). </p></div></div></div>]]></description><pubDate>Mon, 06 Sep 2010 00:17:58 +0100</pubDate><guid isPermaLink="true">http://localhost/</guid></item><item><title>Requerimientos mínimos</title><link>http://localhost/</link><description><![CDATA[<div style="width:700px"><div class="contenido"><div><h3>Requerimientos m&#237;nimos del servidor</h3><p>El servidor de Bingo Intelligence necesita:</p><ul><li>Windows XP, o superior.</li><li>Servidor IIS (con ASP.NET 4, y WCF)</li><li>.NET Framework 4</li><li><span>Microsoft SQL Server 2005, o superior (puede estar en un servidor independiente, y puede ser la versi&#243;n gratuita </span><i>Express</i><span>)</span></li><li>Conexi&#243;n a internet (s&#243;lo para validar el n&#250;mero de licencia)</li></ul><p>Los requerimientos m&#237;nimos de hardware son los mismos que necesitan los componentes anteriores, y Bingo Intelligence no impone ning&#250;n requisito adicional. De todos modos, se recomienda 2Gb de RAM, por lo menos.</p><p>Los requerimientos recomendables, sin embargo, depender&#225;n de la carga de trabajo que vaya a soportar (n&#250;mero de usuarios concurrentes, volumen de datos, etc.).  En general, se recomienda utilizar un sistema operativo dise&#241;ado para servidores (Windows Server 2008, o superior), aunque no es imprescindible. Tambi&#233;n se recomienda ejecutar Windows Update regularmente.</p><p> Conviene tener en cuenta que la m&#225;xima carga de trabajo no la soportar&#225; el servidor de Bingo Intelligence, ni el repositorio de Bingo, ni los clientes de Bingo An&#225;lisis o Bingo Excel. La m&#225;xima carga de trabajo la tendr&#225; el servidor donde residan los datos corporativos, ya que Bingo Intelligence no “resuelve” las consultas directamente, sino que redirige las peticiones de los usuarios hacia el servidor de datos. Es importante, por lo tanto, que ese servidor est&#233; correctamente dimensionado y que el modelo de datos soporte el tipo de consulta que generar&#225; el usuario.</p><p>Si la base de datos que se quiere explotar tiene un volumen de datos reducido, Bingo Intelligence puede acceder directamente a dicha base de datos, y el rendimiento debe ser suficiente. En cambio, si se dispone de una cantidad importante de informaci&#243;n, o se disponen de fuentes heterog&#233;neas que se quieren mezclar, o cuando el n&#250;mero de usuarios sea elevado, entonces se recomienda construir una base de datos espec&#237;fica para los procesos anal&#237;ticos (a esta base de datos se la denomina, habitualmente, datawarehouse o datamart).</p><h3>Requerimientos m&#237;nimos de los clientes</h3><p>Los clientes de Bingo Intelligence necesitan:</p><ul><li>Windows XP, o superior.</li><li>.NET Framework 4</li><li>Microsoft Excel 2003, o superior (s&#243;lo si se quiere utilizar Bingo Excel)</li><li>Conectividad con el servidor de Bingo</li></ul><p>Los requerimientos m&#237;nimos de hardware son los mismos que necesitan los componentes anteriores, y Bingo Intelligence no impone ning&#250;n requisito adicional. De todos modos, se recomienda 2Gb de RAM, por lo menos.</p><p>Para obtener la m&#225;xima funcionalidad, y la capacidad de trabajar con un volumen de datos mayor, se recomienda Microsoft Excel 2007 o Microsoft Excel 2010 (en lugar del Excel 2003).</p><p>Al igual que en el servidor, se recomienda tener los ordenadores lo m&#225;s actualizados que sea posible, y ejecutar regularmente Windows Update.</p></div></div></div>]]></description><pubDate>Mon, 06 Sep 2010 00:17:33 +0100</pubDate><guid isPermaLink="true">http://localhost/</guid></item><item><title>¿Qué es Bingo Intelligence?</title><link>http://localhost/</link><description><![CDATA[<div style="width:700px"><div class="contenido"><div><h3>Definici&#243;n</h3><p>Bingo Intelligence es una plataforma de Business Intelligence que destaca por su facilidad de uso y la potencia de las aplicaciones anal&#237;ticas generadas.</p><h3>Componentes</h3><p>Los componentes de la plataforma son:</p><ul><li><b>Bingo An&#225;lisis.</b><span> Es la herramienta principal que utiliza el usuario de la aplicaci&#243;n. Con Bingo An&#225;lisis, los usuarios pueden crear o consultar los informes, y los t&#233;cnicos pueden definir los </span><i>cat&#225;logos</i><span> (metainformaci&#243;n de las bases de datos). Gracias a los cat&#225;logos, los usuarios pueden acceder a sus datos utilizando el lenguaje propio de su negocio, y no necesitan conocer la estructura de las bases de datos, ni el lenguaje SQL. </span></li><li><b>Bingo Excel.</b><span> Es un complemento a Microsoft Excel que permite integrar las caracter&#237;sticas de consulta y an&#225;lisis de Bingo Intelligence con las hojas de c&#225;lculo Excel. </span></li><li><b>Servidor Bingo.</b><span> Es el servicio web que atiende las peticiones de los usuarios y que realiza las consultas a las bases de datos y al repositorio de Bingo Intelligence. Los clientes (</span><i>Bingo An&#225;lisis</i><span> y </span><i>Bingo Excel</i><span>) nunca se conectan directamente a las bases de datos, y lo hacen siempre a trav&#233;s del servidor Bingo.</span></li><li><b>Repositorio Bingo.</b><span> Es una base de datos </span><i>Microsoft SQL Server</i><span> que mantiene toda la informaci&#243;n de la plataforma. Conviene aclarar que el repositorio s&#243;lo mantiene la estructura de las bases de datos y de los informes corporativos, mientras que los datos propios de la empresa (ventas, pedidos, producci&#243;n...) se encuentran en una base de datos independiente (habitualmente  en un datawarehouse o datamart con fines anal&#237;ticos).</span></li><li><b>Administrador de Bingo Intelligence.</b><span> Es la aplicaci&#243;n que utiliza el administrador del sistema para instalar, configurar y actualizar la plataforma. Con el administrador de Bingo Intelligence, se instala el servidor, se crea el repositorio y se publican los links de instalaci&#243;n de </span><i>Bingo An&#225;lisis</i><span> y </span><i>Bingo Excel</i><span>.</span></li></ul><h3>Tecnolog&#237;a</h3><p>La plataforma Bingo Intelligence utiliza fundamentalmente tecnolog&#237;a de Microsoft:</p><ul><li><span>El servidor Bingo es un servicio ASP.NET que funciona sobre el servidor web </span><i>Internet Information Services</i><span>, y utiliza la tecnolog&#237;a de </span><i>Windows Communication Foundation</i><span> (WCF) para asegurar la integridad y confidencialidad de las comunicaciones entre los clientes y el servidor.</span></li><li><span>Tanto el servidor como los clientes necesitan la versi&#243;n 4 del </span><i>.NET Framework</i><span> de Microsoft.</span></li><li><span>La instalaci&#243;n de los clientes (Bingo An&#225;lisis y Bingo Excel) se realiza desde la propia intranet utilizando una tecnolog&#237;a denominada </span><i>ClickOnce</i><span>. Gracias a esta tecnolog&#237;a, la instalaci&#243;n resulta f&#225;cil y segura, y se facilita enormemente el trabajo de implantaci&#243;n y actualizaci&#243;n de la plataforma entre todos los usuarios.</span></li><li><i>Bingo An&#225;lisis</i><span> es una aplicaci&#243;n web con un frond-end de escritorio. En cierto modo, es un h&#237;brido entre las aplicaciones desktop tradicionales y las aplicaciones web. Bingo An&#225;lisis comparte con las aplicaciones web la posibilidad de instalar y actualizar la aplicaci&#243;n desde la web, y las comunicaciones se realizan siempre utilizando protocolos web (http/https). Por otro lado, no deja de ser una aplicaci&#243;n Windows, y aprovecha la potencia de la m&#225;quina, y las caracter&#237;sticas de Windows, para ofrecer una mejor experiencia de usuario.</span></li><li><i>Bingo Excel</i><span> es un complemento de Excel que utiliza la tecnolog&#237;a </span><i>Visual Studio Tools for Office</i><span> (VSTO). Esta tecnolog&#237;a sustituye a las antiguas macros de Excel, y proporciona una m&#225;xima integraci&#243;n entre las aplicaciones y el propio Excel.</span></li><li><span>El repositorio es una base de datos </span><i>Microsoft SQL Server.</i><span></span></li><li>Bingo Intelligence es una soluci&#243;n ROLAP que puede conectarse a cualquier base de datos relacional. Bingo no impone restricciones en la tecnolog&#237;a o la estructura de la base de datos que contiene la informaci&#243;n corporativa, y puede conectarse indistintamente a cualquier motor de base de datos relacional (Oracle, MySQL, Teradata...).</li></ul></div></div></div>]]></description><pubDate>Mon, 06 Sep 2010 00:17:09 +0100</pubDate><guid isPermaLink="true">http://localhost/</guid></item><item><title>¿Qué son las plantillas de formato?</title><link>http://localhost/</link><description><![CDATA[<div style="width:700px"><div class="contenido"><div><p>Las “plantillas de formato” permiten guardar y reutilizar la configuraci&#243;n est&#233;tica de un panel. Permite guardar las fuentes, los colores, etc&#233;tera que se ha aplicado sobre una tabla o gr&#225;fico. Una vez guardado el formato como una nueva plantilla, es posible reutilizar el mismo formato en cualquier otro panel.</p><h3>Crear plantilla</h3><p><span>Si se quiere guardar el formato de un panel existente debemos seleccionar la opci&#243;n de </span><b>“Guardar como plantilla”</b><span> del men&#250; contextual del panel (hacienco clic con el bot&#243;n derecho).</span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/guardar-como-plantilla.png" alt="Si se quiere guardar el formato de un panel existente debemos seleccionar la opción de “Guardar como plantilla” del menú contextual del panel " title="Si se quiere guardar el formato de un panel existente debemos seleccionar la opción de “Guardar como plantilla” del menú contextual del panel " width="294" height="306" /></p><p>Al guardar la plantilla, se abrir&#225; un formulario con sus propiedades y podremos establecer un nombre para la plantilla reci&#233;n creada. Una vez guardada, aparecer&#225; en la secci&#243;n de “Plantillas” (dentro del bot&#243;n “Formato), tal como muestra la siguiente imagen:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/pestanya-plantillas-formato.png" alt="Una vez guardada, aparecerá en la sección de “Plantillas” (dentro del botón “Formato)" title="Una vez guardada, aparecerá en la sección de “Plantillas” (dentro del botón “Formato)" width="469" height="463" /></p><h3>Aplicar plantilla</h3><p>Para aplicar una plantilla sobre un panel existente, sencillamente se debe arrastrar la plantilla desde el panel de navegaci&#243;n izquierdo (secci&#243;n “Plantillas”) hasta el t&#237;tulo del panel. De este modo, el panel adoptar&#225; la misma apariencia que el panel que se utiliz&#243; para crear la plantilla...</p><h3>Editar plantilla</h3><p>Una vez creada una plantilla es posible modificarla. Estas modificaciones s&#243;lo afectar&#225;n a los nuevos paneles sobre los que se aplique el formato de la plantilla. Al modificar la plantilla no se modifica el formato de los paneles existentes</p><p>Para poder visualizar o modificar las caracter&#237;sticas de una plantilla se debe abrir el formulario de “Propiedades” utilizando el men&#250; contextual:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/propiedades-plantilla-formato.png" alt="Para poder visualizar o modificar las características de una plantilla se debe abrir el formulario de “Propiedades” utilizando el menú contextual" title="Para poder visualizar o modificar las características de una plantilla se debe abrir el formulario de “Propiedades” utilizando el menú contextual" width="275" height="89" /></p><p>De este modo, aparecer&#225; la pantalla con todas las caracter&#237;sticas de la plantilla, y podremos modificarla o renombrarla:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/ventana-propiedades-plantilla-formato.png" alt="La ventana de propiedades de la plantilla muestra su definición y su nombre." title="La ventana de propiedades de la plantilla muestra su definición y su nombre." width="567" height="501" /></p></div></div></div>]]></description><pubDate>Mon, 06 Sep 2010 00:15:08 +0100</pubDate><guid isPermaLink="true">http://localhost/</guid></item><item><title>¿Qué son las paletas de colores?</title><link>http://localhost/</link><description><![CDATA[<div style="width:700px"><div class="contenido"><div><p>La “paleta de colores” determina el color principal y la apariencia del entorno de usuario de la aplicaci&#243;n. Esta configuraci&#243;n afecta a todos los botones y formularios de Bingo An&#225;lisis.</p><p>Actualmente, existen 6 paletas de colores que se pueden utilizar para personalizar la apariencia de la aplicaci&#243;n:</p><ul><li>Azul</li><li>Plata</li><li>Negro</li><li>Azul brillo</li><li>Plata brillo</li><li>Negro brillo</li></ul><p>Las siguientes imagen corresponde a la aplicaci&#243;n configurada con distintas paletas de colores (negro y plata brillo, concretamente)</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/paleta-colores-negro.png" alt="Pantalla de Bingo Análisis con la paleta de colores &quot;Negro&quot;." title="Pantalla de Bingo Análisis con la paleta de colores &quot;Negro&quot;." width="399" height="275" /></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/paleta-colores-plata-brillo.png" alt="Pantalla de Bingo Análisis con la paleta de colores &quot;Plata Brillo&quot;." title="Pantalla de Bingo Análisis con la paleta de colores &quot;Plata Brillo&quot;." width="386" height="266" /></p><p>La paleta de colores se puede definir a nivel global (de la soluci&#243;n) o se puede configurar para cada aplicaci&#243;n en particular.</p><h3>Paleta de colores de la soluci&#243;n</h3><p>En las propiedades de la soluci&#243;n se puede configurar la paleta de colores de la soluci&#243;n.</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/paleta-colores-solucion.png" alt="En las propiedades de la solución se puede configurar la paleta de colores de la solución." title="En las propiedades de la solución se puede configurar la paleta de colores de la solución." width="542" height="527" /></p><p>Esta configuraci&#243;n aplica al dise&#241;ador de cat&#225;logos, y a cualquier aplicaci&#243;n que tenga la paleta de colores “predeterminada”.</p><h3>Paleta de colores de la aplicaci&#243;n</h3><p>Cada aplicaci&#243;n se puede configurar con una paleta de colores en particular. Si se selecciona la paleta “predeterminada”, entonces se utiliza la paleta de colores de la soluci&#243;n.</p><p>Para poder cambiar la paleta de una aplicaci&#243;n, se debe abrir la ventana de “Propiedades de aplicaci&#243;n”, y modificar el desplegable correspondiente de la pesta&#241;a “Avanzado”: </p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/paleta-colores-aplicacion.png" alt="Cada aplicación se puede configurar con una paleta de colores en particular. Si se selecciona la paleta “predeterminada”, entonces se utiliza la paleta de colores de la solución." title="Cada aplicación se puede configurar con una paleta de colores en particular. Si se selecciona la paleta “predeterminada”, entonces se utiliza la paleta de colores de la solución." width="567" height="680" /></p></div></div></div>]]></description><pubDate>Mon, 06 Sep 2010 00:14:44 +0100</pubDate><guid isPermaLink="true">http://localhost/</guid></item><item><title>¿Qué fórmulas incluye la plataforma Bingo Intelligence?</title><link>http://localhost/</link><description><![CDATA[<div style="width:700px"><div class="contenido"><div><p>Existen un gran n&#250;mero de f&#243;rmulas a aplicar a los objetos. Puedes crear una f&#243;rmula utilizando operadores aritm&#233;ticos, operadores l&#243;gicos, f&#243;rmulas anal&#237;ticas y los objetos de la consulta.</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/editor-formulas.png" alt="El asistente de fórmulas de Bingo Intelligence" title="El asistente de fórmulas de Bingo Intelligence" width="453" height="450" /></p><p>En el editor de f&#243;rmulas puedes consultar la sintaxis de una f&#243;rmula as&#237; como un inventario de las disponibles.</p><h3>Funciones disponibles</h3><p>Las funciones que Bingo permite son las siguientes:</p><h4>Funciones de agregaci&#243;n</h4><ul><li>avg</li><li>count</li><li>max</li><li>min</li><li>stddev</li><li>stdev</li><li>sum</li><li>var</li></ul><h4>Funciones anal&#237;ticas</h4><ul><li>ntile</li><li>rank</li><li>rankdense</li><li>rownumber</li><li>runningsum</li></ul><h3>Funciones num&#233;ricas</h3><ul><li>abs</li><li>ceiling</li><li>exp</li><li>floor</li><li>greatest</li><li>hex</li><li>isnull</li><li>isnumeric</li><li>least</li><li>log</li><li>log10</li><li>newid</li><li>power</li><li>rand</li><li>round</li><li>sign</li><li>sqrt</li></ul><h3>Funciones de fecha</h3><ul><li>dateadd</li><li>datediff</li><li>datepart</li><li>day</li><li>dayofweek</li><li>dayofyear</li><li>getdate</li><li>getutcdate</li><li>hour</li><li>isdate</li><li>milisecond</li><li>minute</li><li>month</li><li>second</li><li>timeofday</li><li>year</li></ul><h4>Funciones de cadena</h4><ul><li>ascii</li><li>charindex</li><li>chow</li><li>datalength</li><li>leith</li><li>len</li><li>lower</li><li>ltrim</li><li>replace</li><li>replicate</li><li>right</li><li>rtrim</li><li>substring</li><li>trim</li><li>upper</li></ul><h4>Funciones trigonom&#233;tricas</h4><ul><li>acos</li><li>asin</li><li>atan</li><li>cos</li><li>cosh</li><li>sin</li><li>sinh</li><li>tan</li><li>tanh</li></ul></div></div></div>]]></description><pubDate>Mon, 06 Sep 2010 00:13:05 +0100</pubDate><guid isPermaLink="true">http://localhost/</guid></item><item><title>Cómo añadir una columna calculada</title><link>http://localhost/</link><description><![CDATA[<div style="width:700px"><div class="contenido"><div><p><span>Tal como se ha </span><a href="http://help.bingointelligence.com/articulo.html?id=15">explicado previamente</a><span> se pueden a&#241;adir columnas arrastr&#225;ndolas desde el cat&#225;logo. Sin embargo, de esa manera solo se pueden incluir las dimensiones e indicadores definidos en el cat&#225;logo.</span></p><p><span>Con Bingo Intelligence el usuario de negocio puede crear tambi&#233;n </span><b>columnas calculadas</b><span>. Gracias a esta funcionalidad, pueden a&#241;adirse datos que no est&#225;n definidos en el cat&#225;logo. Podr&#225;s, por ejemplo, calcular el precio medio, o concatenar varias dimensiones, entre otras muchas cosas.</span></p><p><span>Para ello, debes seleccionar la opci&#243;n de </span><b>“Agregar columna calculada”</b><span> del men&#250; contextual:</span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/agregar-columna-calculada.png" alt="La opción para agregar una columna calculada está en el menú contextual." title="La opción para agregar una columna calculada está en el menú contextual." width="466" height="237" /></p><p>Entonces, aparecer&#225; el cuadro de propiedades de la nueva columna, desde donde se puede fijar el nombre de la columna, el formato, y la propia f&#243;rmula:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/propiedades-columna-calculada.png" alt="El formulario de la nueva columna permite fijar el nombre, el formato y la propia fórmula." title="El formulario de la nueva columna permite fijar el nombre, el formato y la propia fórmula." width="606" height="466" /></p><p><span>La f&#243;rmula se puede escribir directamente, aunque es preferible abrir el </span><b>“Editor de f&#243;rmulas”</b><span> para ver los objetos de la consulta y las funciones que se pueden utilizar.</span></p><p>El editor de f&#243;rmulas muestra todas las columnas de la consulta y todas las f&#243;rmulas disponibles. </p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/formula-calculada-asistente.png" alt="El asistente de fórmulas permite editar o definir la fórmula fácilmente." title="El asistente de fórmulas permite editar o definir la fórmula fácilmente." width="428" height="426" /></p><p><a href="http://help.bingointelligence.com/articulo.html?id=26">Bingo Intelligence incorpora muchas funciones anal&#237;ticas y matem&#225;ticas</a><span>.</span></p></div></div></div>]]></description><pubDate>Mon, 06 Sep 2010 00:12:24 +0100</pubDate><guid isPermaLink="true">http://localhost/</guid></item><item><title>¿Cómo se hace análisis OLAP con Bingo Intelligence?</title><link>http://localhost/</link><description><![CDATA[<div style="width:700px"><div class="contenido"><div><p><span>En este apartado se describen las funcionalidades de Bingo Intelligence para realizar </span><a href="http://help.bingointelligence.com/articulo.html?id=24">an&#225;lisis OLAP</a><span>.</span></p><p><b>Estas acciones est&#225;n accesibles a trav&#233;s del  men&#250; contextual</b><span> que aparece haciendo clic en el bot&#243;n derecho del rat&#243;n.</span><b></b></p><h3>Filtros de consulta</h3><p><b>Un “filtro de consulta” afecta sobre toda la informaci&#243;n de la consulta.</b><span> De este modo, si a&#241;ades el filtro “A&#241;o 2012”, el panel s&#243;lo tendr&#225; informaci&#243;n del a&#241;o 2012.</span></p><p>Se puede agregar un filtro seleccionando cualquier dimensi&#243;n del cat&#225;logo (en el men&#250; contextual aparece todo el cat&#225;logo):</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/olap-filtros-consulta.png" alt="Un “filtro de consulta” afecta sobre toda la información de la consulta. De este modo, si añades el filtro “Año 2012”, el panel sólo tendrá información del año 2012." title="Un “filtro de consulta” afecta sobre toda la información de la consulta. De este modo, si añades el filtro “Año 2012”, el panel sólo tendrá información del año 2012." width="567" height="201" /></p><h3>Filtros de columna</h3><p><b>Un filtro de columna afecta exclusivamente a  una columna del panel.</b><span> De este modo, por ejemplo, es posible comparar las “Ventas de Espa&#241;a” con las “Ventas resto Europa”</span></p><p><span>Los filtros de columna s&#243;lo es posible aplicarlos sobre </span><i>indicadores</i><span> (y no sobre </span><i>dimensiones</i><span>). </span></p><p>Tambi&#233;n se a&#241;aden desde el men&#250; contextual:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/olap-filtros-columna.png" alt="Un filtro de columna afecta exclusivamente a  una columna del panel. De este modo, por ejemplo, es posible comparar las “Ventas de España” con las “Ventas resto Europa”." title="Un filtro de columna afecta exclusivamente a  una columna del panel. De este modo, por ejemplo, es posible comparar las “Ventas de España” con las “Ventas resto Europa”." width="567" height="191" /></p><h3>Agregar/sustituir columnas</h3><p>En el men&#250; contextual tambi&#233;n aparecen opciones para agregar a la consulta cualquier objeto del cat&#225;logo:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/olap-agregar-columnas.png" alt="En el menú contextual también aparecen opciones para agregar a la consulta cualquier objeto del catálogo." title="En el menú contextual también aparecen opciones para agregar a la consulta cualquier objeto del catálogo." width="567" height="204" /></p><p>Tambi&#233;n es posible cambiar el nivel de detalle de la consulta. La opci&#243;n “Sustituir” del men&#250; contextual te permite cambiar unas columnas por otras:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/olap-sustituir.png" alt="También es posible cambiar el nivel de detalle de la consulta. La opción “Sustituir” del menú contextual te permite cambiar unas columnas por otras." title="También es posible cambiar el nivel de detalle de la consulta. La opción “Sustituir” del menú contextual te permite cambiar unas columnas por otras." width="567" height="407" /></p><h3>Drill down</h3><p><span>Haciendo clic con el bot&#243;n derecho del rat&#243;n sobre una fila de la consulta, aparece la opci&#243;n de </span><b>“Explorar por”. </b><span>Esta opci&#243;n agrega un filtro y sustituye una columna por otra. Es decir, es posible profundizar en la informaci&#243;n del 2012, viendo los datos para cada uno de los trimestres del 2012. O se puede profundizar en las ventas de Espa&#241;a, viendo los datos desglosados por las poblaciones de Espa&#241;a.</span></p><p><span>Este tipo de an&#225;lisis es el que se conoce como </span><b>“Drill down”:</b><span></span></p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/olap-drill-down.png" alt="Haciendo clic con el botón derecho del ratón sobre una fila de la consulta, aparece la opción de “Explorar por”. Este tipo de análisis es el que se conoce como “Drill down”.
" title="Haciendo clic con el botón derecho del ratón sobre una fila de la consulta, aparece la opción de “Explorar por”. Este tipo de análisis es el que se conoce como “Drill down”.
" width="401" height="391" /></p><p>Al profundizar en la informaci&#243;n, aparecen unos botones en la parte superior del panel que permiten modificar o deshacer la navegaci&#243;n:</p><p style="text-align:center"><img src="http://help.bingointelligence.com/imagenes/olap-deshacer-drill-down.png" alt="Al profundizar en la información, aparecen unos botones en la parte superior del panel que permiten modificar o deshacer la navegación." title="Al profundizar en la información, aparecen unos botones en la parte superior del panel que permiten modificar o deshacer la navegación." width="567" height="523" /></p><h3>OLAP “estructural”</h3><p>Las opciones anteriores muestran las posibilidades de OLAP tradicional. Gracias a estas caracter&#237;sticas, es posible ajustar una consulta para que muestre exactamente lo que necesitamos.</p><p><span>Sin embargo, podemos utilizar las posibilidades de crear informes din&#225;micos de Bingo Intelligence para mostrar la misma informaci&#243;n, con todas sus posibilidades anal&#237;ticas, pero </span><b>sin modificar la estructura de ninguna tabla</b><span>.</span></p><p>Por ejemplo, es muy f&#225;cil crear un informe con tres paneles y que  nos muestre la informaci&#243;n por a&#241;os, por trimestres, y por meses. Si creamos las dependencias entre esos tres paneles, tendremos un informe din&#225;mico que permitir&#225; el acceso r&#225;pido y f&#225;cil a cualquier nivel de detalle.</p><p>Este es otro tipo de an&#225;lisis OLAP que est&#225; impl&#237;cito en todos los informes de Bingo Intelligence.</p></div></div></div>]]></description><pubDate>Mon, 06 Sep 2010 00:11:54 +0100</pubDate><guid isPermaLink="true">http://localhost/</guid></item><item><title>¿Qué es el análisis OLAP?</title><link>http://localhost/</link><description><![CDATA[<div style="width:700px"><div class="contenido"><div><p>El an&#225;lisis OLAP es una funcionalidad anal&#237;tica que proporcionan las herramientas de Business Intelligence para permitir ver la informaci&#243;n desde diferentes puntos de vistas.</p><p>T&#237;picamente, el an&#225;lisis OLAP permite al usuario seleccionar la informaci&#243;n que desea mostrar en una tabla o gr&#225;fico. Existen tres acciones b&#225;sicas que debe ser capaz de realizar:</p><ul><li>De una manera muy f&#225;cil, el usuario debe ser capaz de seleccionar los filtros que aplican sobre su informe</li><li>Debe ser capaz de seleccionar las filas/columnas que desea mostrar (ya sea a&#241;adiendo nuevas columnas, o sustituyendo unas por otras).</li><li><span>Debe ser capaz de profundizar en la informaci&#243;n. De este modo, ha de ser posible hacer </span><i>drill down </i><span>sobre los datos para ver la informaci&#243;n sucesivamente por pa&#237;s, regi&#243;n y ciudad, por ejemplo.</span></li></ul><p><span>Bingo Intelligence incorpora </span><a href="http://help.bingointelligence.com/articulo.html?id=25">muchas funcionalidades para hacer este tipo de an&#225;lisis</a><span> tan din&#225;mico. </span></p></div></div></div>]]></description><pubDate>Mon, 06 Sep 2010 00:11:24 +0100</pubDate><guid isPermaLink="true">http://localhost/</guid></item></channel></rss>