<?xml version="1.0" encoding="utf-8"?>
 <rss xmlns:atom="http://www.w3.org/2005/Atom" version="2.0">
 <channel>
   <title>CRONO</title>
   <atom:link href="https://businessintelligence.es/rss.xml" rel="self" type="application/rss+xml" />
   <link>https://businessintelligence.es</link>
   <description></description>

 <item>
      <guid isPermaLink="true">https://businessintelligence.es/blog/ganar-invertir-conocimiento.html</guid>
      <link>https://businessintelligence.es/blog/ganar-invertir-conocimiento.html</link>
      <title>Inversi&#243;n en conocimiento</title>
      <pubDate>Thu, 20 Oct 2016 00:00:00 GMT</pubDate>
      <atom:updated>2016-10-20T00:00:00Z</atom:updated>
      <description>
	  &lt;div style=&quot;width:700px&quot;&gt;&lt;img class=&quot;w100p&quot; src=&quot;https://businessintelligence.es/blog/images/ganar-invertir-conocimiento.jpg&quot; /&gt;
	  &lt;p&gt;Tanto en el mundo profesional como en lo personal es importante invertir correctamente el dinero, el tiempo y los esfuerzos.&lt;/p&gt;
&lt;p&gt;Hoy en d&#237;a &lt;strong&gt;la inversi&#243;n en conocimiento&lt;/strong&gt; es una obligaci&#243;n de todas las empresas ambiciosas. El futuro empresarial depender&#225; de lo bien (y r&#225;pido) que podamos conocer nuestros procesos, nuestro mercado y nuestros clientes. Este conocimiento extra nos ha de permitir detectar oportunidades, prever riesgos, y tomar decisiones acertadas en base a ello.&lt;/p&gt;
&lt;p&gt;El primer gran paso seguro que ya lo hab&#233;is realizado: Registrar los datos de los procesos productivos, financieros, de ventas, de log&#237;stica, entre otros. El siguiente paso necesario es analizar y exprimir estos datos hasta convertirlos en informaci&#243;n y conocimiento &#250;til. En este sentido, los datos brutos son la materia para obtener el conocimiento que nos permitir&#225; tomar decisiones acertadas.&lt;/p&gt;
&lt;p&gt;En Crono te ayudamos a no perder tiempo en extraer o analizar la informaci&#243;n y obtener este conocimiento de manera f&#225;cil y sencilla. Descarga nuestra demo y te sorprender&#225;s.&lt;/p&gt;

	   
	  
	  &lt;/div&gt;</description>
</item>
 <item>
      <guid isPermaLink="true">https://businessintelligence.es/blog/especialistas-business-intelligence.html</guid>
      <link>https://businessintelligence.es/blog/especialistas-business-intelligence.html</link>
      <title>Zapatero a tus zapatos</title>
      <pubDate>Tue, 18 Oct 2016 16:47:47 GMT</pubDate>
      <atom:updated>2016-10-18T16:47:47Z</atom:updated>
      <description>
	  &lt;div style=&quot;width:700px&quot;&gt;&lt;img class=&quot;w100p&quot; src=&quot;https://businessintelligence.es/blog/images/zapatero-a-tus-zapatos.jpg&quot; /&gt;
	  &lt;p&gt;Los tiempos en que un &lt;strong&gt;Leonardo Da Vinci&lt;/strong&gt; pod&#237;a ser una eminencia en todos los campos del conocimiento ya han pasado y no volver&#225;n. En el mundo global y competitivo en el que vivimos la &#250;nica manera de conseguir la excelencia es mediante la especializaci&#243;n. Haz lo que quieras pero, si quieres hacerlo bien, tendr&#225;s que hacer una cosa, tendr&#225;s que especializarte, focalizarte. Zapatero a tus zapatos.&lt;/p&gt;
&lt;p&gt;En Crono somos especialistas. Nos hemos especializado en el Business Intelligence: Desde el entendimiento de las necesidades, pasando por la modelizaci&#243;n del data warehouse y la creaci&#243;n de los procesos ETL de aprovisionamiento, y hasta la presentaci&#243;n en pantalla y el an&#225;lisis por parte del usuario. Para diferenciarnos en un mercado tan competitivo valoramos la simplicidad y la facilidad de uso por encima de cualquier otro criterio.&lt;/p&gt;
&lt;p&gt;Gracias a esta especializaci&#243;n (y diferenciaci&#243;n), conseguimos que nuestros clientes puedan ser especialistas en lo suyo. Que no pierdan tiempo y esfuerzo en extraer informaci&#243;n o generar informes. Para eso ya tienen Crono.&lt;/p&gt;

	   
	  
	  &lt;/div&gt;</description>
</item>
 <item>
      <guid isPermaLink="true">https://businessintelligence.es/blog/ser-flexible-mente-abierta.html</guid>
      <link>https://businessintelligence.es/blog/ser-flexible-mente-abierta.html</link>
      <title>El enorme potencial de una mente abierta</title>
      <pubDate>Fri, 14 Oct 2016 00:00:00 GMT</pubDate>
      <atom:updated>2016-10-14T00:00:00Z</atom:updated>
      <description>
	  &lt;div style=&quot;width:700px&quot;&gt;&lt;img class=&quot;w100p&quot; src=&quot;https://businessintelligence.es/blog/images/ser-flexible-mente-abierta.jpg&quot; /&gt;
	  &lt;p&gt;&lt;a href=&quot;https://twitter.com/jesslivingston?lang=es&quot; title=&quot;Jessica Livingston&quot;&gt;Jessica Livingston&lt;/a&gt; es fundadora de una acelaradora de statups. Como tal, se dedica a la mentorizaci&#243;n, la formaci&#243;n y la consultor&#237;a estrat&#233;gica en el &#225;mbito empresarial. Es la autora de la frase que encabeza este art&#237;culo. Esta frase la podr&#237;a firmar cualquier participante de GH, el autor de una teleserie de zoombies, o cualquier analista que dispone de un mont&#243;n de datos y necesita sacar valor de ello. Pero... &#191;Qu&#233; quiere decir tener una mente abierta?&lt;/p&gt;
&lt;p&gt;Tener la &amp;quot;mente abierta&amp;quot; implicar ser receptivo a nuevas ideas y diferentes opiniones o puntos de vista. Tener una mentalidad abierta implica estar en disposici&#243;n de escuchar las propuestas de los dem&#225;s, incluso si van en contra de nuestro criterio. Desde luego que esto suena razonable, y por este motivo la &amp;quot;apertura mental&amp;quot; tiene tantos defensores. Lo dif&#237;cil, como siempre, es practicarlo, porque no es lo mismo predicar que dar trigo.&lt;/p&gt;
&lt;p&gt;Desconozco si es posible potenciar o cambiar algo tan &amp;quot;&#237;ntimo&amp;quot; como la apertura mental de cada cual. Pero, si quieres intentarlo, a nosotros no ha gustado este &lt;a href=&quot;https://lamenteesmaravillosa.com/el-enorme-potencial-de-una-mente-abierta/&quot; title=&quot;La mente es maravillosa&quot;&gt;dec&#225;logo para aprender a pensar diferente&lt;/a&gt;:&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;Ponerse a s&#237; mismo a prueba.&lt;/strong&gt; Es bueno salir cada tanto de la “zona segura”.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Cuestionar las cosas un poco m&#225;s.&lt;/strong&gt; &#191;Qui&#233;n dijo que hay que aceptar las cosas tal como te las presentan el sistema y los dem&#225;s? Si algo te confunde o no encaja, no dudes en cuestionarlo.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Aprender a pensar m&#225;s all&#225; de lo que est&#225; delante de uno.&lt;/strong&gt; Es necesario comprender que todo est&#225; conectado y tu poder para anticipar y pensar en el futuro puede ayudarte enormemente.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;No tener miedo a equivocarse.&lt;/strong&gt; Es muy bueno arriesgar de vez en cuando. Si tienes una excesiva auto-exigencia o demasiado miedo a cometer errores, nunca har&#225;s nada.&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;Permitir que otras personas nos sirvan de inspiraci&#243;n.&lt;/strong&gt; La apertura mental est&#225; muy relacionada con la humildad, pues quien cree saberlo todo nunca podr&#225; aprender de los dem&#225;s y no ser&#225; capaz de replantearse o cuestionar sus ideas o creencias.&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;En resumen, es necesario pensar diferente para liberarse de las propias limitaciones. Las personas de mente abierta tienen m&#225;s posibilidades de alcanzar todo su potencial en la vida porque arriesgan, se atreven, exploran, no se quedan con la opci&#243;n m&#225;s f&#225;cil. Las personas con apertura mental son buscadores incansables, inconformistas en el buen sentido de la palabra y siempre est&#225;n dispuestos a aprender de todos y de todo.&lt;/p&gt;
&lt;p&gt;Y t&#250;, &#191;est&#225;s abierto?&lt;/p&gt;

	   
	  
	  &lt;/div&gt;</description>
</item>
 <item>
      <guid isPermaLink="true">https://businessintelligence.es/blog/no-problemas-pensamiento-eficiente-abierto-diferente.html</guid>
      <link>https://businessintelligence.es/blog/no-problemas-pensamiento-eficiente-abierto-diferente.html</link>
      <title>Same Thinking, same results</title>
      <pubDate>Thu, 06 Oct 2016 00:00:00 GMT</pubDate>
      <atom:updated>2016-10-06T00:00:00Z</atom:updated>
      <description>
	  &lt;div style=&quot;width:700px&quot;&gt;&lt;img class=&quot;w100p&quot; src=&quot;https://businessintelligence.es/blog/images/einstein-same-thinking.jpg&quot; /&gt;
	  &lt;p&gt;La palabra &amp;quot;problema&amp;quot; nos provoca incomodidad y preocupaci&#243;n. Sin embargo, los problemas son siempre una oportunidad de mejora. Muchas veces los problemas son consecuencia de un mal h&#225;bito o un mal proceso, y el reto no es tanto buscar una &amp;quot;soluci&#243;n&amp;quot; al problema existente sino repensar totalmente el h&#225;bito o proceso que nos ha provocado la dificultad.&lt;/p&gt;
&lt;p&gt;En el &#225;mbito del Business Intelligence, se nos ocurren muchas situaciones donde se han apilado soluciones intermedias sin cuestionarse si es el propio proceso que est&#225; mal planteado de inicio. Por poner un ejemplo, &#191;Qui&#233;n no ha vivido el problema de la proliferaci&#243;n incontrolada de Excels con datos y criterios dispares? &#191;Y cu&#225;ntas veces la &amp;quot;soluci&#243;n&amp;quot; ha consistido en incorporar una herramienta BI que se usa fundamentalmente para seguir exportando los datos a Excel y seguir multiplicando el n&#250;mero de informes que circulan por nuestra organizaci&#243;n...?&lt;/p&gt;
&lt;p&gt;Por cierto, no es la primera vez que recurrimos a una &lt;a href=&quot;http://businessintelligence.es/blog/einstein.html&quot; title=&quot;Todo deber&#237;a ser tan simple como sea posible&quot;&gt;cita de Einstein&lt;/a&gt;.&lt;/p&gt;
&lt;p&gt;Repiensa. Redise&#241;a. Mu&#233;vete. Simplifica.&lt;/p&gt;

	   
	  
	  &lt;/div&gt;</description>
</item>
 <item>
      <guid isPermaLink="true">https://businessintelligence.es/blog/datos-como-manzanas.html</guid>
      <link>https://businessintelligence.es/blog/datos-como-manzanas.html</link>
      <title>Datos como manzanas</title>
      <pubDate>Mon, 03 Oct 2016 14:12:16 GMT</pubDate>
      <atom:updated>2016-10-03T14:12:16Z</atom:updated>
      <description>
	  &lt;div style=&quot;width:700px&quot;&gt;&lt;img class=&quot;w100p&quot; src=&quot;https://businessintelligence.es/blog/images/datos-como-manzanas.jpg&quot; /&gt;
	  &lt;p&gt;Muchas veces vemos empresas que recogen y recogen datos sin nunca llegar a hacer nada con ellos. Sabemos que la informaci&#243;n es poder, pero, &#191;De qu&#233; sirve recopilar la informaci&#243;n si luego no es tratada ni analizada? A veces es por falta de tiempo o recursos y otras veces es por falta de herramientas que te faciliten el an&#225;lisis efectivo de esta informaci&#243;n corporativa que &lt;a href=&quot;http://businessintelligence.es/blog/dark-data.html&quot; title=&quot;Los datos m&#225;s importantes ya los tienes&quot;&gt;ya tienes&lt;/a&gt;. &#191;Cu&#225;l es tu excusa para no analizar los datos que ya tienes?&lt;/p&gt;
&lt;p&gt;Hacemos hincapi&#233; en el hecho que la informaci&#243;n &lt;strong&gt;ya la tienes&lt;/strong&gt; porque la informaci&#243;n m&#225;s valiosa es la de tus propias ventas, pedidos u ordenes de fabricaci&#243;n... Si esa informaci&#243;n ya la tienes, acceder a ella con facilidad &lt;strong&gt;DEBE SER UNA PRIORIDAD&lt;/strong&gt; de primer orden para tu organizaci&#243;n.&lt;/p&gt;

	   
	  
	  &lt;/div&gt;</description>
</item>
 <item>
      <guid isPermaLink="true">https://businessintelligence.es/blog/lo-bueno-si-breve-dos-veces-bueno.html</guid>
      <link>https://businessintelligence.es/blog/lo-bueno-si-breve-dos-veces-bueno.html</link>
      <title>Lo bueno, si breve...</title>
      <pubDate>Mon, 26 Sep 2016 22:15:28 GMT</pubDate>
      <atom:updated>2016-09-26T22:15:28Z</atom:updated>
      <description>
	  &lt;div style=&quot;width:700px&quot;&gt;&lt;img class=&quot;w100p&quot; src=&quot;https://businessintelligence.es/blog/images/lo-bueno-si-breve-dos-veces-bueno.jpg&quot; /&gt;
	  &lt;p&gt;Como sab&#237;a Don Sancho Panza, el refranero espa&#241;ol es rico y tiene recursos para todas
las necesidades. Para bautizar este blog hemos escogido este que recomienda brevedad
en todo lo que se haga. En este blog nos hemos propuesto transmitir nuestros valores
y nuestras opiniones sobre tecnolog&#237;a y Business Intelligence en pocas palabras. 
Porque valoramos vuestro tiempo. Y el nuestro. Y porque vale m&#225;s una imagen que mil palabras.&lt;/p&gt;
&lt;p&gt;S&#237;guenos y te prometemos que no encontrar&#225;s aqu&#237; art&#237;culos de Jot Down. Y, al mismo precio, estar&#225;s
informado sobre las aventuras y andanzas de Crono Business Intelligence, la plataforma m&#225;s fresca
y prometedora del mercado BI patrio.&lt;/p&gt;

	   
	  
	  &lt;/div&gt;</description>
</item>
 <item>
      <guid isPermaLink="true">https://businessintelligence.es/blog/ockam.html</guid>
      <link>https://businessintelligence.es/blog/ockam.html</link>
      <title>Principio de parsimonia</title>
      <pubDate>Mon, 05 Sep 2016 00:00:00 GMT</pubDate>
      <atom:updated>2016-09-05T00:00:00Z</atom:updated>
      <description>
	  &lt;div style=&quot;width:700px&quot;&gt;&lt;img class=&quot;w100p&quot; src=&quot;https://businessintelligence.es/blog/images/ockam.jpeg&quot; /&gt;
	  &lt;p&gt;El principio de Ockam nos invita a no multiplicar las entidades innecesariamente. Es un regla de profundas implicaciones en ciencia, filosof&#237;a, medicina, econom&#237;a y... tambi&#233;n en el BI y en la gesti&#243;n de la informaci&#243;n. Hay algo que estamos haciendo rematadamente mal cuando vemos que los reports y los excels se multiplican sin parar, cuando aparecen dimensiones e indicadores que es imposible diferenciar, cuando repetimos los mismos procesos ETL proyecto tras proyecto... En estas situaciones, conviene SIMPLIFICAR y UNIFICAR.&lt;/p&gt;

	   
	  
	  &lt;/div&gt;</description>
</item>
 <item>
      <guid isPermaLink="true">https://businessintelligence.es/blog/john-tukey.html</guid>
      <link>https://businessintelligence.es/blog/john-tukey.html</link>
      <title>Los datos pueden mostrarte una historia que no esperabas encontrar</title>
      <pubDate>Mon, 29 Aug 2016 00:00:00 GMT</pubDate>
      <atom:updated>2016-08-29T00:00:00Z</atom:updated>
      <description>
	  &lt;div style=&quot;width:700px&quot;&gt;&lt;img class=&quot;w100p&quot; src=&quot;https://businessintelligence.es/blog/images/john-tukey.jpeg&quot; /&gt;
	  &lt;p&gt;Mostrar como va el negocio o destacar posibles oportunidades es una tarea que no a todos se nos da bien. Por esto, es
muy importante convertir los datos en algo apto para el consumo humano. Es decir, organizarlos correctamente para sacar
de ellos el m&#225;ximo partido. Con las herramientas visuales adecuadas, los datos pueden mostrarte una historia que no esperabas encontrar.&lt;/p&gt;

	   
	  
	  &lt;/div&gt;</description>
</item>
 <item>
      <guid isPermaLink="true">https://businessintelligence.es/blog/pensamientos-innovadores.html</guid>
      <link>https://businessintelligence.es/blog/pensamientos-innovadores.html</link>
      <title>La simplicidad se reconoce cuando la ves</title>
      <pubDate>Mon, 22 Aug 2016 00:00:00 GMT</pubDate>
      <atom:updated>2016-08-22T00:00:00Z</atom:updated>
      <description>
	  &lt;div style=&quot;width:700px&quot;&gt;&lt;img class=&quot;w100p&quot; src=&quot;https://businessintelligence.es/blog/images/pensamientos-innovadores.jpeg&quot; /&gt;
	  &lt;p&gt;Los &lt;a href=&quot;https://www.youtube.com/watch?v=sgWWXSEw0Dc&quot;&gt;pensamientos innovadores&lt;/a&gt; a menudo son malinterpretados o
vistos como una p&#233;rdida de tiempo. Un pensamiento innovador es aquello que va mas all&#225; de lo obvio y no tan obvio. Es
ver en algo ordinario lo extraordinario. En Crono impulsamos el negocio de nuestros clientes con pensamientos y
herramientas innovadoras.&lt;/p&gt;

	   
	  
	  &lt;/div&gt;</description>
</item>
 <item>
      <guid isPermaLink="true">https://businessintelligence.es/blog/si-no-lo-sabes-explicar.html</guid>
      <link>https://businessintelligence.es/blog/si-no-lo-sabes-explicar.html</link>
      <title>Si no lo sabes explicar, no lo entiendes suficientemente</title>
      <pubDate>Mon, 15 Aug 2016 00:00:00 GMT</pubDate>
      <atom:updated>2016-08-15T00:00:00Z</atom:updated>
      <description>
	  &lt;div style=&quot;width:700px&quot;&gt;&lt;img class=&quot;w100p&quot; src=&quot;https://businessintelligence.es/blog/images/si-no-lo-sabes-explicar.jpeg&quot; /&gt;
	  &lt;p&gt;Si ten&#233;is que dar muchas vueltas o us&#225;is mucho tiempo y recursos para explicaros; es que no lo
entiendes bien o te falta algo para poder atar lo que quer&#233;is mostrar. Como expertos en BI ayudamos
a que los datos de negocio se conviertan en informaci&#243;n que hable por s&#237; sola de forma simple y
sintetizada a todos los niveles de la organizaci&#243;n.&lt;/p&gt;

	   
	  
	  &lt;/div&gt;</description>
</item>


   
</channel>
</rss>
